<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<html>
<head>



  


  
  
  
  
  
  <title>TermoGraf: Ventana &quot;Enviar e-mail&quot;</title>
  <meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">




  
  
  
  
<link rel="stylesheet" href="../../styles.css">
</head>


<body lang="es">




<h1>Ventana &quot;Enviar e-mail&quot;</h1>




<p>Esta ventana permite enviar un correo electr&oacute;nico desde TermoGraf. Est&aacute; 
  pensada para que los alumnos puedan enviar sus dudas o los ejercicios resueltos 
  al profesor sin depender del ordenador desde el que est&eacute;n trabajando, 
  ya que podr&iacute;a tener un programa de correo de dif&iacute;cil configuraci&oacute;n 
  o simplemente no tenerlo instalado.</p>




<table align="center" border="0">
  <tr valign="top"> 
    <td nowrap> 
      <h2 align="center">Contenido</h2>
      <ul>
        <li><a href="#data">Panel &quot;Datos del env&iacute;o&quot;</a></li>
        <li><a href="#conection">Panel &quot;Conexi&oacute;n SMTP&quot;</a></li>
        <li><a href="#message">Panel &quot;Mensaje&quot;</a></li>
      </ul>
    </td>
  </tr>
</table>




 <br>




<table align="center" border="0">




  <tr>




    <td nowrap>
      
      
      
      <div align="center">
      
      
      
        <p style="text-align: center;"> <img src="../../reference/winAux/img/win_mail.gif" border="0"></p>




      </div>




    </td>




  </tr>




  <tr>




      
    <td class="piefoto" nowrap>Ventana &quot;Enviar e-mail&quot;</td>




  </tr>




  
  
  
</table>




<p></p>
<hr width="75%">
<h1>Contenido</h1>




<h2><a name="data"></a>Panel &quot;Datos del env&iacute;o&quot;</h2>




 
  
<blockquote>
  <p>En este panel se configuran los datos para que el mail sea enviado correctamente.</p>
  <ul>
    <li><b>Para:</b> Direcci&oacute;n de e-mail de la persona a la que va dirigida 
      el e-mail.</li>
    <li><b>De:</b> Direcci&oacute;n de e-mail de la persona que env&iacute;a el 
      e-mail.</li>
    <li><b>Asunto:</b> T&iacute;tulo del e-mail.</li>
    <li><b>Adjuntar:</b> Documento que se env&iacute;a adjunto al e-mail, por 
      ejemplo el ejercicio de TermoGraf con el que se est&aacute; trabajando.</li>
    <li>
      <p><b>Opci&oacute;n &quot;Adjuntar documento actual de TermoGraf&quot;:</b> 
        Env&iacute;a una copia del documento con el que se est&aacute; trabajando. 
        Es necesario que el documento se haya grabado anteriormente en el ordenador.</p>
      <p></p>
    </li>
  </ul>
  <p>&nbsp;</p>
</blockquote>
<p></p>




<h2><a name="conection"></a>Panel &quot;Conexi&oacute;n SMTP&quot;</h2>




 
  
<blockquote>
  <p>Este panel configura los datos del servidor de correo a trav&eacute;s del 
    cual mandar el e-mail. El protocolo utilizado es SMTP -Simple Mail Transfer 
    Protocol-, ampliamente utilizado por los servidores de correo. No obstante 
    algunos servidores no permiten la utilizaci&oacute;n de este protocolo obligando 
    a utilizar otro tipo de env&iacute;o, como por ejemplo los correos basados 
    &uacute;nicamente en p&aacute;ginas web los cuales no podr&aacute;n enviar 
    el e-mail.</p>
  <ul>
    <li><b>Servidor:</b> Direcci&oacute;n del servidor de correo. Normalmente, 
      en un correo &quot;miNombre@miDominio.com&quot; se suele utilizar la direcci&oacute;n 
      &quot;smtp.miDominio.com&quot;.</li>
    <li><b>Usuario:</b> Nombre del usuario de correo. Es la palabra situada delante 
      de la arroba &quot;@&quot;.</li>
    <li><b>Contrase&ntilde;a:</b> La contrase&ntilde;a personal del usuario de 
      correo.</li>
  </ul>
</blockquote>
<p><br>
</p>
<p></p>




<h2><a name="message"></a>Panel &quot;Mensaje&quot;</h2>




 
  
<blockquote>
  <p>Texto del mensaje que se desea enviar.</p>
</blockquote>
<p>&nbsp;</p>
</body>
</html>
