<html><head><title>Documentación programa difracción de Fresnel y Fraunhofer</title>

<meta name="description" content="hypertext">
<meta name="keywords" content="hypertext">
<meta name="resource-type" content="document">
<meta name="distribution" content="global">
<meta http-equiv="Content-Type" content="text/html&gt;
&lt;META NAME=" generator="">
<meta http-equiv="Content-Style-Type" content="text/css">
<link rel="STYLESHEET" href="entradaA.css">
</head>

<body>

<h1 class="h1joc">Difracción de Fresnel y Fraunhofer</h1>
<p>Esta aplicación permite ver la intensidad del campo difractado en condiciones 
  de Fresnel o Fraunhofer al atravesar algunas aberturas notables. El programa 
  supone que la iluminaci&oacute;n incidente es una onda plana que viaja en la 
  direcci&oacute;n normal al plano que contiene la obertura. En condiciones de 
  Fresnel, la aplicaci&oacute;n puede calcular la difracci&oacute;n para oberturas 
  rectangulares, circulares, rendijas o el semiplano, mientras que en condiciones 
  de Fraunhofer, el c&aacute;lculo se realiza para rect&aacute;ngulos, c&iacute;rculos 
  o rendijas. </p>
<h2 class="h2joc">Difracci&oacute;n de Fresnel</h2>
<p>Sea U(x,y,z) el campo difractado a una distancia z del plano que contiene la 
  obertura &#931;&nbsp;(que consideraremos situada en z=0). U(x<sub>0</sub>,y<sub>0</sub>,0) 
  es el campo en el plano z=0 y (x<sub>0</sub>,y<sub>0</sub>) 
  son las coordenadas en el plano que contiene &#931;. k es el n&uacute;mero de 
  onda y &#955;&nbsp;la longitud de onda. </p>
<p>El c&aacute;lculo en condiciones de Fresnel se realiza cuando las diferencias 
  x-x<sub>0</sub> o y-y<sub>0</sub> son mucho menores 
  que z. En este caso, la ecuaci&oacute;n que relaciona el campo difractado U(x,y,z) 
  con el campo en la obertura U(x<sub>0</sub>,y<sub>0</sub>,0) 
  es:</p>
<p align="center"><img src="formules/Difrac_Ec1.gif"></p>
<p>donde la intensidad se calcula como el m&oacute;dulo al cuadrado del campo 
  difractado. </p>
<p align="center"><img src="formules/Difrac_Ec3.gif"></p>
<p>El programa calcula esta integral en diferentes situaciones. El usuario debe 
  introducir como datos: </p>
<ol>
  <li>la longitud de onda, en el rango de 400 a 700 nm.</li>
  <li>la distancia de propagaci&oacute;n z, entre 100 y 1000 nm.</li>
  <li>la obertura a trav&eacute;s de la cual pasa la luz: 
    <ul>
      <li> rect&aacute;ngulo: deben introducirse los valores de ambos lados. &Eacute;stos 
        puede variar entre 0.5 y 3 mm.</li>
      <li>c&iacute;rculo: el di&aacute;metro var&iacute;a entre 0.5 y 3 mm.</li>
      <li> rendija: la anchura de la misma var&iacute;a entre 0.5 y 3 mm.</li>
      <li>semiplano.</li>
    </ul>
  </li>
</ol>
<p>A continuaci&oacute;n se debe pulsar el bot&oacute;n 'Calcular difracci&oacute;n'. 
  Al cabo de unos instantes, en la imagen de la derecha se muestra la intensidad 
  de la difracci&oacute;n. La imagen de la difracci&oacute;n puede ser analizada 
  de manera que se aprecien mejor las zonas de la imagen con menor energ&iacute;a. 
  Para ello puede escogerse entre la visualizaci&oacute;n </p>
<ol>
  <li>en intensidad (opci&oacute;n por defecto), </li>
  <li>el logaritmo de la intensidad, o bien</li>
  <li>en amplitud (la ra&iacute;z cuadrada de la intensidad). Al seleccionar esta 
    &uacute;ltima opci&oacute;n se activa el deslizable 'Umbral'. El valor m&aacute;ximo 
    de la amplitud de la difracci&oacute;n se normaliza inicialmente a 100. Al 
    seleccionar un cierto valor del umbral, todos los valores por encima de &eacute;ste 
    se ajustan a 100 y los valores por debajo del umbral se renormalizan de nuevo 
    de 0 a 100. </li>
</ol>
<p>Tambi&eacute;n se puede obtener el perfil de la intensidad del eje y=0 al pulsar 
  sobre el bot&oacute;n 'Perfil de la fila central'. La distribuci&oacute;n mostrada 
  corresponde a la intensidad de la difracci&oacute;n sin modificaciones de visualizaci&oacute;n 
  de ning&uacute;n tipo.</p>
<h2 class="h2joc">Difracci&oacute;n de Fraunhofer</h2>
<p>El c&aacute;lculo en condiciones de Fraunhofer se realiza cuando la distancia 
  de propagaci&oacute;n z tiende a infinito. En este caso, la ecuaci&oacute;n 
  que relaciona el campo difractado U(x,y,z) con el campo en la obertura U(x<sub>0 
  </sub>,y<sub>0</sub>,0) es:</p>
<p align="center"><img src="formules/Difrac_Ec2-bis.gif"></p>
<p>En la pr&aacute;ctica, para observar la intensidad de la difracci&oacute;n 
  de Fraunhofer se puede utilizar una lente convergente de focal f' y observar 
  la distribuci&oacute;n en el plano focal de la misma. La obertura se ilumina 
  con una onda plana y el campo difractado se hace pasar por la lente. Se puede 
  demostrar que en el plano focal imagen de la misma se obtiene el mismo campo 
  el&eacute;ctrico escalar que si la propagaci&oacute;n del campo se realizara 
  a una distancia z que tiende a infinito:</p>
<p align="center"><img src="formules/Difrac_Ec2.gif"></p>
<p align="left">Finalmente, la intensidad se calcula como el m&oacute;dulo al 
  cuadrado del campo difractado. </p>
<p align="center"><img src="formules/Difrac_Ec4.gif"></p>
<p align="left">El programa calcula esta integral en diferentes situaciones. El 
  usuario debe introducir como datos: </p>
<ol>
  <li>la longitud de onda, en el rango 400 a 700 nm.</li>
  <li>la focal imagen de la lente entre 500 y 1000 nm.</li>
  <li>la obertura a trav&eacute;s de la cual pasa la luz: 
    <ul>
      <li> rect&aacute;ngulo: debe introducirse el valor de los lados. &Eacute;stos 
        puede variar entre 0.5 y 3 mm.</li>
      <li>c&iacute;rculo: el di&aacute;metro, que puede var&iacute;ar entre 0.5 
        y 3 mm.</li>
      <li> rendija: su anchura puede var&iacute;ar entre 0.5 y 3 mm.</li>
    </ul>
    <p>Los tres objetos pueden replicarse hasta diez veces. La distancia entre 
      ellos es constante.</p>
  </li>
</ol>
<p> La imagen de la difracci&oacute;n puede ser analizada de manera que se aprecien 
  mejor las zonas de la imagen con menor energ&iacute;a. Para ello puede escogerse 
  entre la visualizaci&oacute;n </p>
<ol>
  <li>en intensidad (opci&oacute;n por defecto), </li>
  <li>el logaritmo de la intensidad, o bien</li>
  <li>en amplitud (la ra&iacute;z cuadrada de la intensidad). Al seleccionar esta 
    &uacute;ltima opci&oacute;n se activa el deslizable 'Umbral'. El valor m&aacute;ximo 
    de la amplitud de la difracci&oacute;n se normaliza inicialmente a 100. Al 
    seleccionar un cierto valor del umbral, todos los valores por encima de &eacute;ste 
    se ajustan a 100 y los valores por debajo del umbral se renormalizan de nuevo 
    de 0 a 100. </li>
</ol>
<p class="displaymath">Tambi&eacute;n se puede obtener el perfil de la intensidad 
  del eje y=0 al pulsar sobre el bot&oacute;n 'Perfil de la fila central'. La 
  distribuci&oacute;n mostrada corresponde a la intensidad de la difracci&oacute;n 
  sin modificaciones de visualizaci&oacute;n de ning&uacute;n tipo.</p>
</body></html>