<HTML>
<HEAD>

<TITLE>Documentación programa Interferómetro de Michelson</TITLE>
<META NAME="description" CONTENT="hypertext">
<META NAME="keywords" CONTENT="hypertext">
<META NAME="resource-type" CONTENT="document">
<META NAME="distribution" CONTENT="global">
<META HTTP-EQUIV="Content-Type" CONTENT="text/html>
<META NAME="Generator>
<META HTTP-EQUIV="Content-Style-Type" CONTENT="text/css">
<LINK REL="STYLESHEET" HREF="entradaA.css">
</HEAD>

<h1 class="h1joc">Interferómetro de Michelson</h1>
<p>Esta aplicaci&oacute;n permite estudiar el interfer&oacute;metro de Michelson 
  y ver la evoluci&oacute;n de los anillos cuando se var&iacute;an los par&aacute;metros 
  del sistema. Tambi&eacute;n se analiza el caso de fuente puntual, correspondiente 
  al interfer&oacute;metro de Twyman.</p>

<h2 class="h2joc">Interferómetro de Michelson</h2>
  
<p>El interfer&oacute;metro de Michelson se compone de una fuente extensa situada 
  en el plano focal de una lente (de manera que los rayos salgan paralelos), una 
  l&aacute;mina semiespejada posteriormente que separa el haz en dos y dos espejos. 
  Los haces, después de reflejarse en los espejos, se vuelven a juntar a la salida 
  de la l&aacute;mina dando lugar a interferencias. &Eacute;stas se observan en 
  el plano focal de una lente colimadora. Para compensar la diferencia de caminos 
  &oacute;pticos que recorren los haces en el brazo horizontal y vertical al atravesar 
  una y tres veces la l&aacute;mina, respectivamente, se a&ntilde;ade en el brazo 
  horizontal una lámina compensadora de grosor igual al de la lámina separadora.</p>
<p>Si la intensidad que pasa por cada uno de los dos brazos es igual, el resultado 
  de las interferencias ser&aacute;:</p>

<p align="center"> <img src="formules/Michel_Ec1.gif"></p>

<p>donde <font face=Symbol size=+1>&#955;</font> &nbsp es 
  la longitud de onda de la luz (en el vac&iacute;o) y <font face=Symbol size=+1>&#916;</font> 
  &nbsp es la diferencia de camino &oacute;ptico entre los dos haces de luz, que es 
  consecuencia de la diferencia de longitud entre los brazos del interfer&oacute;metro 
  (d). Si consideramos el haz que entra y sale del sistema formando un &aacute;ngulo 
  <font face=Symbol size=+1>&#952;</font> &nbsp con el eje, 
  puede verse c&oacute;mo:</p>
  
<p align="center"> <img src="formules/Michel_Ec2.gif"></p>

<p>donde n es el índice de refracci&oacute;n del medio en el que se encuentra 
  el interfer&oacute;metro. La condici&oacute;n de interferencia constructiva 
  o destructiva se dar&aacute; cuando esta diferencia de camino &oacute;ptico 
  sea un m&uacute;ltiplo entero de la longitud de onda o un m&uacute;ltiplo impar 
  de media longitud de onda, respectivamente:</p>  
  
<p align="center"> <img src="formules/Michel_Ec3.gif"></p>

<p> Por lo tanto, todos los rayos que formen el mismo &aacute;ngulo con el eje 
  estar&aacute;n en el mismo estado interferencial. Al observarlos en el plano 
  focal de una lente de focal f', se ver&aacute;n anillos de interferencia de 
  radios:</p>

<p align="center"> <img src="formules/Michel_Ec4.gif"></p>

<p>Cabe observar c&oacute;mo los radios (&aacute;ngulos) m&aacute;s grandes corresponden 
  a los &oacute;rdenes interferenciales m&aacute;s peque&ntilde;os. Por otra parte, 
  en el centro de la imagen (<font face=Symbol size=+1>&#952;</font>=0), 
  la diferencia de camino &oacute;ptico ser&aacute; 2nd y por lo tanto s&oacute;lo 
  habr&aacute; un m&iacute;nimo o un m&aacute;ximo en el caso que esta cantidad 
  sea un m&uacute;ltiplo entero de media o de una longitud de onda. 
<p>El programa permite modificar los par&aacute;metros del sistema (longitud de 
  onda <font face=Symbol size=+1>&#955;</font>&nbsp de la luz en el vac&iacute;o, distancia 
  d entre espejos, &iacute;ndice de refracci&oacute;n n del medio) y muestra los 
  anillos de interferencia en el color correspondiente a la longitud de onda seleccionada. 
  La anchura de la zona de visi&oacute;n var&iacute;a con la focal de la lente, 
  ya que los radios de los anillos son directamente proporcionales a &eacute;sta. 
  Pulsando el bot&oacute;n &quot;Gr&aacute;fico&quot; se ve el perfil de intensidades, 
  mientras que al pulsar el bot&oacute;n &quot;Imagen&quot; se vuelve a la imagen 
  de la figura de interferencia, que es la que aparece por defecto al entrar en 
  el programa. Cabe observar c&oacute;mo la separaci&oacute;n entre los m&aacute;ximos 
  disminuye con la distancia al centro, es decir, los anillos est&aacute;n cada 
  vez m&aacute;s juntos yendo hacia el exterior de la imagen. 
<p>Adem&aacute;s, al pulsar el bot&oacute;n &quot;Esquema&quot;, el programa muestra 
  un esquema para calcular la diferencia de camino &oacute;ptico entre los dos 
  haces de luz. Pulsando el mismo bot&oacute;n, que ahora se llama &quot;Montaje&quot;, 
  se vuelve a ver el diagrama del interfer&oacute;metro de Michelson, que aparece 
  por defecto al entrar en el programa. 
<p>Una aplicaci&oacute;n de este programa consiste en medir la longitud de onda 
  de la luz contando cu&aacute;ntos anillos claros u oscuros aparecen o desaparecen 
  por el centro de la imagen (<font face=Symbol size=+1>&#952;</font>=0) 
  cuando se var&iacute;a la distancia entre los espejos entre dos puntos que den 
  interferencia constructiva o destructiva, respectivamente. Si el n&uacute;mero 
  de anillos que aparecen o desaparecen es N y d<sub>1</sub> y d<sub>2</sub> son 
  la distancia entre espejos inicial y final, la longitud de onda es: 
<p align="center"> <img src="formules/Michel_Ec5.gif"></p>

<p>A medida que aumentamos la distancia entre espejos, aparecen anillos por el 
  centro, mientras que, si acercamos los espejos, desaparecen.</p>

<h2 class="h2joc">Interferómetro de Twyman</h2>

<p>El interferómetro de Twyman es id&eacute;ntico al de Michelson excepto que 
  en este caso la fuente es puntual. Por lo tanto, todos los rayos estar&aacute;n 
  en el mismo estado interferencial y la intensidad de la figura de interferencia 
  ser&aacute; constante. Su valor depender&aacute; de la diferencia de camino 
  &oacute;ptico 2nd, de manera que para que cambie de m&aacute;ximo a m&iacute;nimo, 
  la distancia entre los espejos debe variar <font face=Symbol size=+1>&#955;</font>/4n.</p>
  
<br>
<h2 class="h2joc">Glosario</h2>

<table width="250" border="0" align="left" cellpadding="5" cellspacing="0">
  <tr> 
    <td class="glost" width="155">Longitud de onda</td>
    <td width="75"><font face=Symbol size=+1>&#955;</font></td>
  </tr>
  <tr> 
    <td class="glost" width="155">Distancia espejos</td>
    <td width="75">d</td>
  </tr>
  <tr> 
    <td class="glost" width="155">&Iacute;ndice de refracci&oacute;n</td>
    <td width="75">n</td>
  </tr>
  <tr> 
    <td class="glost" width="155">Focal lente</td>
    <td width="75">f'</td>
  </tr>
</table>

</BODY>
</HTML>