<html> 
<head> 
<title>Documentació programa difracció de Fresnel i Fraunhofer</title> 

<meta name="description" content="hypertext"> 
<meta name="keywords" content="hypertext"> 
<meta name="resource-type" content="document"> 
<meta name="distribution" content="global"> 
<meta http-equiv="Content-Type" content="text/html&gt;
&lt;META NAME=" generator=""> 
<meta http-equiv="Content-Style-Type" content="text/css"> 
<link rel="STYLESHEET" href="entradaA.css"> 
</head> 

<body> 

<h1 class="h1joc">Difracció de Fresnel i Fraunhofer</h1> 
<p>Aquesta aplicaci&oacute; permet veure la intensitat del camp difractat en condicions 
  de Fresnel o Fraunhofer en travessar algunes obertures notables. El programa 
  suposa que la il&middot;luminaci&oacute; incident &eacute;s una ona plana que 
  viatja en la direcci&oacute; normal al pla que cont&eacute; l'obertura. En condicions 
  de Fresnel, el programa pot calcular la difracci&oacute; per obertures rectangulars, 
  circulars, l'escletxa o el semipl&agrave;, mentre que en condicions de Fraunhofer, 
  el c&agrave;lcul es realitza per a rectangles, cercles o escletxes. </p> 
<h2 class="h2joc">Difracci&oacute; de Fresnel</h2> 
<p>Sigui <i>U</i>&nbsp;(<i>x</i>,&nbsp;<i>y</i>,&nbsp;<i>z</i>) el camp difractat a una dist&agrave;ncia <i>z</i> del pla 
  que cont&eacute; l'obertura &#931;&nbsp;(que considerarem situada a <i>z</i>&nbsp;=&nbsp;0). <i>U</i>&nbsp;(<i>x</i><sub>0</sub>,&nbsp;<i>y</i><sub>0</sub>,&nbsp;0) 
  &eacute;s el camp en el pla <i>z</i>&nbsp;=&nbsp;0 i (<i>x</i><sub>0</sub>,&nbsp;<i>y</i><sub>0</sub>) s&oacute;n les 
  coordenades en el pla de &#931;. <i>k</i> &eacute;s el n&uacute;mero d'ona 
  i &#955; &eacute;s la longitud d'ona. </p> 
<p>El c&agrave;lcul en condicions de Fresnel es realitza quan les difer&egrave;ncies 
  <i>x</i>&nbsp;-&nbsp;<i>x</i><sub>0</sub> o <i>y</i>&nbsp;-&nbsp;<i>y</i><sub>0</sub> s&oacute;n molt m&eacute;s petites que <i>z</i>. 
  En aquest cas, l'equaci&oacute; que relaciona el camp difractat <i>U</i>&nbsp;(<i>x</i>,&nbsp;<i>y</i>,&nbsp;<i>z</i>) amb 
  el camp en l'obertura <i>U</i>&nbsp;(<i>x</i><sub>0</sub>,&nbsp;<i>y</i><sub>0</sub>,0) &eacute;s:</p> 
<p align="center"> 
<img src="formules/Difrac_Ec1.gif"> 
</p> 
<p>on la intensitat es calcula com el m&ograve;dul al quadrat del camp difractat,</p> 
<p align="center"> 
<img src="formules/Difrac_Ec3.gif"> 
</p> 
<p>El programa calcula aquesta integral en diferents situacions. L'usuari ha d'introduir 
  les dades seg&uuml;ents:</p> 
<ol> 
  <li>La longitud d'ona, en el rang de 400 a 700 nm.</li> 
  <li>La dist&agrave;ncia de propagaci&oacute; <i>z</i>, entre 100 i 1000 mm.</li> 
  <li>L'obertura a trav&eacute;s de la qual passa la llum: 
    <ul> 
      <li>rectangle (han d'introduir-se els valors dels dos costats. Aquests 
        poden variar entre 0,5 i 3 mm)</li> 
      <li>cercle (el di&agrave;metre varia entre 0,5 i 3 mm)</li> 
      <li>escletxa (l'amplada pot variar entre 0,5 i 3 mm)</li> 
      <li>semipl&agrave;</li> 
    </ul> 
  </li> 
</ol> 
<p>A continuaci&oacute; s'ha de polsar el bot&oacute; <i>Calcular difracci&oacute;</i>. 
  Passats uns instants, en la imatge de la dreta es mostra la intensitat de la 
  difracci&oacute;. La imatge de la difracci&oacute; pot ser analitzada de manera 
  que s'apreci&iuml;n millor les zones de la imatge amb menys energia. Per aix&ograve; 
  pot escollir-se entre les visualitzacions seg&uuml;ents:</p> 
<ol> 
  <li>En intensitat (opci&oacute; per defecte)</li> 
  <li>Logaritme de la intensitat</li> 
  <li>En amplitud (l'arrel quadrada de la intensitat). </li>
 <p>En seleccionar aquesta 
    darrera opci&oacute; s'activa el lliscador <i>Llindar</i>. El valor m&agrave;xim 
    de l'amplitud de la difracci&oacute; es normalitza inicialment a 100. En seleccionar 
    un cert valor del llindar, tots els valors per sobre d'aquest s'ajusten a 
    100 i els valors per sota del llindar es renormalitzen de nou de 0 a 100. 
  </p> 
</ol> 
<p>Tamb&eacute; es pot obtenir el perfil de la intensitat de l'eix <i>y</i>&nbsp;=&nbsp;0 en
  polsar el bot&oacute; <i>Perfil de la fila central</i>. La distribuci&oacute; mostrada 
  correspon a la intensitat de la difracci&oacute; sense modificacions de visualitzaci&oacute;.</p> 
<h2 class="h2joc">Difracci&oacute; de Fraunhofer</h2> 
<p>El c&agrave;lcul en condicions de Fraunhofer es realitza quan la dist&agrave;ncia 
  de propagaci&oacute; <i>z</i> tendeix a infinit. En aquest cas, l'equaci&oacute; 
  que relaciona el camp difractat <i>U</i>&nbsp;(<i>x</i>,&nbsp;<i>y</i>,&nbsp;<i>z</i>) amb el camp en l'obertura <i>U</i>&nbsp;(<i>x</i><sub>0</sub>,&nbsp;<i>y</i><sub>0</sub>,&nbsp;0) 
  &eacute;s:</p> 
<p align="center"> 
<img src="formules/Difrac_Ec2-bis.gif"> 
</p> 
<p>En la pr&agrave;ctica, per observar la intensitat de la difracci&oacute; de 
  Fraunhofer es pot utilitzar una lent convergent de focal <i>f'</i> i observar la distribuci&oacute; 
  en el pla focal de la mateixa. L'obertura s'il&middot;lumina amb una ona plana 
  i el camp difractat es fa passar per la lent. Es pot demostrar que en el pla 
  focal imatge de la mateixa s'obt&eacute; el mateix camp el&egrave;ctric escalar 
  que si la propagaci&oacute; del camp es fes a una dist&agrave;ncia <i>z</i> que tendeix 
  a l'infinit:</p> 
<p align="center"> 
<img src="formules/Difrac_Ec2.gif"> 
</p> 
<p align="left">Finalment, la intensitat es calcula com el m&ograve;dul al quadrat 
  del camp difractat. </p> 
<p align="center"> 
<img src="formules/Difrac_Ec4.gif"> 
</p> 
<p align="left">El programa calcula aquesta integral en diferents situacions. 
  L'usuari ha d'introduir les dades seg&uuml;ents: </p> 
<ol> 
  <li>La longitud d'ona, en el rang 400 a 700 nm.</li> 
  <li>La focal imatge de la lent entre 500 i 1000 mm.</li> 
  <li>L'obertura a trav&eacute;s de la qual passa la llum: 
    <ul> 
      <li>rectangle (han d'introduir-se els valors dels dos costats, que
        poden variar entre 0,5 i 3 mm)</li> 
      <li>Cercle (el di&agrave;metre, que pot variar entre 0,5 i 3 mm)</li> 
      <li>Escletxa (l'amplada pot variar entre 0,5 i 3 mm)</li> 
    </ul> 
    <p>Els tres objectes poden replicar-se fins a deu vegades. La dist&agrave;ncia 
      entre ells &eacute;s constant.</p> 
  </li> 
</ol> 
<p>La imatge de la difracci&oacute; pot ser analitzada de manera que s'apreci&iuml;n 
  millor les zones de la imatge amb menys energia. Per aix&ograve; pot escollir-se 
  entre la visualitzaci&oacute;</p> 
<ol> 
  <li>En intensitat (opci&oacute; per defecte)</li> 
  <li>Logaritme de la intensitat, o b&eacute;</li> 
  <li>En amplitud (l'arrel quadrada de la intensitat)</li>
<p>En seleccionar aquesta darrera opci&oacute; s'activa el lliscador <i>Llindar</i>. El valor
  m&agrave;xim de l'amplitud de la difracci&oacute; es normalitza inicialment a 100. En  
  seleccionar un cert valor del llindar, tots els valors per sobre d'aquest s'ajusten a 
  100 i els valors per sota del llindar es renormalitzen de nou de 0 a 100. </p> 
</ol> 
<p>Tamb&eacute; es pot obtenir el perfil de la intensitat de l'eix <i>y</i>&nbsp;=&nbsp;0 en
  polsar el bot&oacute; <i>Perfil de la fila central</i>. La distribuci&oacute; mostrada 
  correspon a la intensitat de la difracci&oacute; sense modificacions de visualitzaci&oacute; 
  de cap tipus.</p> 
</body> 
</html>