<HTML>
<HEAD>

<TITLE>Documentación programa Polarización de la Luz</TITLE>

<META NAME="description" CONTENT="hypertext">
<META NAME="keywords" CONTENT="hypertext">
<META NAME="resource-type" CONTENT="document">
<META NAME="distribution" CONTENT="global">
<META HTTP-EQUIV="Content-Type" CONTENT="text/html">
<META NAME="Generator" CONTENT="LaTeX2HTML v2K.1beta">
<META HTTP-EQUIV="Content-Style-Type" CONTENT="text/css">
<LINK REL="STYLESHEET" HREF="entradaA.css">
</HEAD>

<BODY>

<h1 class="h1joc">Polarización de la luz y leyes de Fresnel</h1>

<p>En esta aplicaci&oacute;n se estudia la polarizaci&oacute;n de la luz y su 
  reflexi&oacute;n y refracci&oacute;n en medios is&oacute;tropos. Una primera 
  ventana muestra c&oacute;mo conseguir los diferentes estados de polarizaci&oacute;n 
  de la luz a partir de la superposici&oacute;n de dos ondas planas con ciertas 
  caracter&iacute;sticas. Una segunda y tercera ventana permiten ver el comportamiento 
  de las ondas reflejada y transmitida dependiendo de las propiedades de una onda 
  incidente sobre la superficie de separaci&oacute;n de dos medios. El segundo 
  medio puede ser diel&eacute;ctrico o conductor. Se estudia tanto la relaci&oacute;n 
  de amplitudes (coeficientes de Fresnel) como la variaci&oacute;n de la elipse 
  de polarizaci&oacute;n.</p>

<h2 class="h2joc">Ventana "Polarización"</h2>

<p>En esta ventana se estudia la superposición de dos ondas planas con sus vectores 
  eléctricos perpendiculares, que viajan en la misma dirección, tienen la misma 
  frecuencia, amplitudes diferentes y desfasadas entre sí.</p>

<p>Las barras de desplazamiento permiten modificar las amplitudes de las ondas 
  p (A<sub>p</sub>) y s (A<sub>s</sub>) y el desfase &#948; 
  &nbsp;entre ellas. El gráfico situado en la parte inferior representa ambas ondas. 
  Los campos eléctricos E<sub>p</sub> y E<sub>s</sub> asociados pueden expresarse 
  como:</p>

<p align="center"> <img src="formules/Polar_Ec1.gif"> </p>

<p>El campo eléctrico resultante genera, al propagarse, una espiral de paso elíptico, 
  que se representa en el gráfico superior izquierdo. Se indican asimismo las 
  características de dicha elipse de polarización: las longitudes de los semiejes 
  mayor y menor, y el ángulo de la elipse respecto al eje p, en grados. También 
  se indica el vector de Stokes <b>S</b> que describe el estado de polarización 
  de la luz. Los parámetros de Stokes se calculan según:</p>
  
<p align="center"> <img src="formules/Polar_Ec2.gif"> </p>

<p>El signo del parámetro S indica si la luz es dextrógira (S&gt;0), es decir, 
  que gira en el sentido de las agujas del reloj, o levógira (S&lt;0), cuando 
  gira en sentido antihorario. Esto se indica dentro del recuadro negro de la 
  elipse con una D o con una L, respectivamente.</p>
  
<h2 class="h2joc">Ventana "Diel&eacute;ctricos"</h2>

<p>En esta ventana se estudia la reflexión y refracción de la luz en medios dieléctricos 
  isótropos, haciendo hincapié en las fórmulas de Fresnel, que especifican los 
  valores que toma la amplitud del campo al cambiar de medio o reflejarse, en 
  función de la amplitud incidente. Se supone adem&aacute;s que los medios son 
  no absorbentes para las longitudes de onda con las que se trabaja.</p>

<p>Si una onda incide sobre una superficie que separa dos medios de índices de 
  refracción n y n' con un ángulo &#966;&nbsp;(respecto a la normal 
  a la superficie), ésta se refleja con un ángulo de reflexión igual al incidente 
  y se transmite al segundo medio con un ángulo refractado &#966;' 
  dado por la ley de Snell:</p>

<p align="center"> <img src="formules/Polar_Ec3.gif"> </p>

<p>Las barras de desplazamiento permiten modificar los índices de refracción de 
  los dos medios y el ángulo de incidencia. La aplicación calcula el ángulo de 
  refracción y pinta los rayos incidente (rojo), reflejado (verde) y refractado 
  (azul). También calcula los coeficientes de Fresnel, que son los cocientes de 
  las amplitudes reflejada (A'') o refractada (A') respecto a la incidente (A):</p>

<p align="center"> <img src="formules/Polar_Ec4.gif"> </p>

<p>Los subíndices p y s hacen referencia al campo que vibra paralela (p) o perpendicularmente 
  (s) al plano de incidencia. &Eacute;ste viene determinado por el rayo incidente 
  y la normal a la superficie (en el dibujo corresponde al plano de la propia 
  pantalla). La componente p se representa con un vector con diferentes orientaciones 
  en este plano, mientras que la componente s se representa con un vector que 
  apunta hacia fuera o dentro del plano de la pantalla.</p>
  
<p>En el caso de incidencia normal, las f&oacute;rmulas resultan:</p>

<p align="center"> <img src="formules/Polar_Ec5.gif"> </p>

<p>Cuando el botón <b>"Coeficientes de Fresnel"</b> ha sido pulsado (opci&oacute;n 
  activa por defecto al entrar en el programa), se muestra con diferentes colores 
  la variación de los coeficientes de Fresnel con el ángulo de incidencia. Un 
  punto amarillo superpuesto sobre la gr&aacute;fica indica el ángulo de incidencia 
  seleccionado. Existen varios casos de particular interés:</p>

<ul>
  <li> En el caso de que el índice del primer medio sea mayor que el del segundo 
    (n&gt;n') puede producirse el fenómeno de <b>reflexión total</b>, para el 
    cual no hay luz transmitida. Esto se da para ángulos de incidencia mayores 
    al ángulo límite &#966;<sub>l</sub> (ángulo de incidencia 
    para el cual &#966;'=&#960;/2):</li>
  <p align="center"> <img src="formules/Polar_Ec6.gif"> </p>
  <p>&aacute;ngulo que se muestra en la gr&aacute;fica. En este caso, se tiene:</p>
  <p align="center"> <img src="formules/Polar_Ec7.gif"> </p>
  <p>es decir, los dos coeficientes de reflexi&oacute;n tienen m&oacute;dulo 1 
    y entre las dos componentes s&oacute;lo hay un desfase 2(&#946;-&#945;)-&#960;&nbsp; 
    (el ángulo &#960;&nbsp; 
    hace referencia al signo negativo de r<sub>p</sub>), con</p>
  <p align="center"> <img src="formules/Polar_Ec8.gif"> </p>
  <p>donde</p>
  <p align="center"> <img src="formules/Polar_Ec9.gif"> </p>
  <li> Cuando la luz incide con el ángulo de Brewster &#966;<sub>B</sub>, 
    r<sub>p</sub>=0 y sólo existe luz reflejada en el plano perpendicular al de 
    incidencia. El ángulo de Brewster, que se muestra en la gráfica, se calcula 
    según:</li>
  <p align="center"> <img src="formules/Polar_Ec10.gif"> </p>
</ul>

<p>Pulsando el botón <b>"Polarización"</b> se activa una nueva ventana, en la 
  que se muestran las elipses de polarización de la luz incidente, reflejada y 
  transmitida, cada una con los mismos colores que los rayos correspondientes. 
  La escala de los ejes va entre 0 y 1, en el caso de que ésta cambie se indica 
  la posición de los nuevos valores. Se muestran también las características de 
  la onda incidente, que son las que se han introducido en la ventana "Polarización" 
  y que se pueden modificar accediendo a dicha ventana.</p>

<p>En el caso de que haya <b>reflexión total</b>, no se pinta la elipse de polarización 
  transmitida (azul), ya que no existe. Adem&aacute;s, se muestran los valores 
  de los &aacute;ngulos 2&#945;&nbsp;(angp) y 
  2&#946;&nbsp;(angs), y también el desfase total 
  entre la componente s y p para la luz reflejada, que ser&aacute; el que llevaba 
  la luz incidente m&aacute;s (angs-angp-&#960;). 
  Se puede ver c&oacute;mo &eacute;ste var&iacute;a con el &aacute;ngulo de incidencia 
  y los &iacute;ndices, y c&oacute;mo por reflexi&oacute;n total se puede obtener 
  luz polarizada el&iacute;ptica a partir de luz incidente polarizada linealmente.</p>

<p>Por otra parte, se puede observar cómo para un ángulo de incidencia igual al 
  de Brewster, la luz reflejada está polarizada linealmente en la direcci&oacute;n 
  perpendicular al plano de incidencia.</p>

<h2 class="h2joc">Ventana "Conductores"</h2>

<p>En esta ventana se estudia la reflexión cuando la luz incide sobre un medio 
  is&oacute;tropo de conductividad no nula. En este caso el &iacute;ndice de refracci&oacuten 
  del segundo medio es complejo,</p>

<p align="center"> <img src="formules/Polar_Ec11.gif"> </p>

<p>donde n' y k (coeficiente de extinci&oacute;n) son constantes reales y positivas 
  relacionadas con la constante diel&eacute;ctrica y la conductividad del medio. 
  En el programa n' puede variar entre 0.1 y 3.5 y k puede variar entre 0 (caso 
  &quot;diel&eacute;ctricos&quot;) y 5.</p>

<p>Las f&oacute;rmulas de Fresnel anteriores contin&uacute;an siendo v&aacute;lidas 
  pero considerando el índice de refracción complejo para el segundo medio. Los 
  coeficientes de reflexi&oacuten, después de algunas operaciones, resultan:</p>

<p align="center"> <img src="formules/Polar_Ec12.gif"> </p>

<p>donde todas les cantidades son reales excepto el &iacute;ndice de refracci&oacute;n 
  del segundo medio y el producto</p>

<p align="center"> <img src="formules/Polar_Ec13.gif"> </p>

<p>y se ha tenido en cuenta que la ley de Snell sigue siendo v&aacute;lida:</p>

<p align="center"> <img src="formules/Polar_Ec14.gif"> </p>

<p>Aqu&iacute; &#966;' tiene un sentido formal y su interpretaci&oacute;n 
  no es geom&eacute;trica.</p>
  
<p>Como los coeficientes de Fresnel anteriores son complejos, las ondas reflejadas 
  pueden sufrir cambios de fase (&#958;<sub>p</sub> y &#958;<sub>s</sub> 
  para la componente paralela y perpendicular, respectivamente), que dependen 
  tanto de los &iacute;ndices de refracci&oacute;n de los dos medios como del 
  &aacute;ngulo de incidencia. Estos par&aacute;metros se pueden modificar con 
  las barras de desplazamiento. Se muestra tambi&eacute;n el desfase total entre 
  la componente s y p para la luz reflejada, que ser&aacute; el que llevaba la 
  luz incidente m&aacute;s (&#958;<sub>s</sub>-&#958;<sub>p</sub>). 
  Cabe destacar c&oacute;mo en el caso que en la reflexi&oacute;n no se introduzca 
  un desfase adicional entre las dos componentes, las ondas incidente y reflejada 
  giran en sentido opuesto (si una es dextr&oacute;gira, la otra es lev&oacute;gira, 
  y viceversa). Esto es s&oacute;lo consecuencia de que cuando describimos el 
  estado de polarizaci&oacute;n de estas dos ondas las estamos mirando desde lados 
  opuestos (siempre se debe observar la onda en el sentido en el que avanza).</p>
  
<p>En el caso de incidencia normal, se recuperan las fórmulas que se han visto 
  para los diel&eacute;ctricos pero con el índice de refracción complejo, es decir: 
</p>
  
<p align="center"> <img src="formules/Polar_Ec15.gif"> </p>

<p>El caso de la luz<b> transmitida</b> requiere un an&aacute;lisis m&aacute;s 
  exhaustivo. Aqu&iacute; s&oacute;lo se estudia el caso de <b>incidencia normal</b>, 
  para el cual el factor de transmisi&oacute;n T, definido como el cociente entre 
  la energ&iacute;a por unidad de &aacute;rea transmitida respecto a la incidente, 
  resulta:</p>

<p align="center"> <img src="formules/Polar_Ec16.gif"> </p>

<p>(R es el factor de reflexi&oacute;n). La onda transmitida se puede escribir 
  como una onda plana que se propaga en el medio conductor en la direcci&oacute;n 
  z (perpendicular a la superficie de separaci&oacute;n) y con un &iacute;ndice 
  de refracci&oacute;n complejo. Su campo el&eacute;ctrico se puede escribir como: 
</p>

<p align="center"> <img src="formules/Polar_Ec17.gif"> </p>

<p>Esto corresponde a una onda plana que se propaga en un medio de &iacute;ndice 
  n' pero con una amplitud que decae exponencialmente con la distancia recorrida 
  en el medio (se ha considerado que z=0 coincide con la superficie de separaci&oacuten). 
  Esta dependencia se muestra en una gr&aacute;fica, as&iacute; como la distancia 
  que debe recorrer la onda dentro del medio conductor para que su amplitud decaiga 
  en un factor 1/e, que se llama profundidad de penetraci&oacute;n (z<sub>p</sub>) 
  y caracteriza al medio:</p>

<p align="center"> <img src="formules/Polar_Ec18.gif"> </p>

<p>&#955;&nbsp;es la longitud de onda de la luz y también se 
  puede modificar con una barra de desplazamiento.</p>

<br>  
<h2 class="h2joc">Glosario</h2>

<table width="700" border="0" align="left" cellpadding="5" cellspacing="0">
  <tr> 
    <td class="glostit" width="110">Polarizaci&oacute;n</td>
    <td width="37">&nbsp;</td>
    <td class="glostit" width="137">Diel&eacute;ctricos</td>
    <td width="87">&nbsp;</td>
    <td class="glostit" width="193">Conductores</td>
    <td width="76">&nbsp;</td>
  </tr>
  <tr> 
    <td class="glost" width="110">Amplitud onda p</td>
    <td width="37">A<sub>p</sub></td>
    <td class="glost" width="137">&Aacute;ngulo de incidencia</td>
    <td width="87">&#966;</td>
    <td class="glost" width="193">&Aacute;ngulo de incidencia</td>
    <td width="76">&#966;</td>
  </tr>
  <tr> 
    <td class="glost" width="110">Amplitud onda s</td>
    <td width="37">A<sub>s</sub></td>
    <td class="glost" width="137">&Aacute;ngulo de refracción</td>
    <td width="87">&#966;'</td>
    <td class="glost" width="193">Longitud de onda</td>
    <td width="76">&#955;</td>
  </tr>
  <tr> 
    <td class="glost" width="110">Desfase</td>
    <td width="37">&#948;</td>
    <td class="glost" width="137">&Aacute;ngulo de Brewster</td>
    <td width="87">&#966;<sub>B</sub></td>
    <td class="glost" width="193">angp</td>
    <td width="76">&#958;<sub>p</sub></td>
  </tr>
  <tr> 
    <td class="glost" width="110">&nbsp;</td>
    <td width="37">&nbsp;</td>
    <td class="glost" width="137">&Aacute;ngulo l&iacute;mite</td>
    <td width="87">&#966;<sub>l</sub></td>
    <td class="glost" width="193">angs</td>
    <td width="76">&#958;<sub>s</sub></td>
  </tr>
  <tr> 
    <td class="glost" width="110">&nbsp;</td>
    <td width="37">&nbsp;</td>
    <td class="glostit2" width="137">Reflexi&oacute;n total</td>
    <td width="87">&nbsp;</td>
    <td class="glost" width="193">Desfase total</td>
    <td width="76">&#948;+&#958;<sub>s</sub>-&#958;<sub>p</sub></td>
  </tr>
  <tr> 
    <td class="glost" width="110">&nbsp;</td>
    <td width="37">&nbsp;</td>
    <td class="glost" width="137">angp</td>
    <td width="87">2&#945;</td>
    <td class="glost" width="193">Profundidad de penetraci&oacute;n</td>
    <td width="76">z<sub>p</sub></td>
  </tr>
  <tr> 
    <td class="glost" width="110">&nbsp;</td>
    <td width="37">&nbsp;</td>
    <td class="glost" width="137">angs</td>
    <td width="87">2&#946;</td>
    <td class="glost" width="193">&nbsp;</td>
    <td width="76"></td>
  </tr>
  <tr> 
    <td class="glost" width="110">&nbsp;</td>
    <td width="37">&nbsp;</td>
    <td class="glost" width="137">Desfase total</td>
    <td width="87">&#948;+2(&#946;-&#945;)-&#960;</td>
    <td class="glost" width="193">&nbsp;</td>
    <td width="76">&nbsp;</td>
  </tr>
</table>

</BODY>
</HTML>