<HTML> 
<HEAD> 

<TITLE>Documentació programa Polarització de la Llum</TITLE> 

<META NAME="description" CONTENT="hypertext"> 
<META NAME="keywords" CONTENT="hypertext"> 
<META NAME="resource-type" CONTENT="document"> 
<META NAME="distribution" CONTENT="global"> 
<META HTTP-EQUIV="Content-Type" CONTENT="text/html"> 
<META NAME="Generator" CONTENT="LaTeX2HTML v2K.1beta"> 
<META HTTP-EQUIV="Content-Style-Type" CONTENT="text/css"> 
<LINK REL="STYLESHEET" HREF="entradaA.css"> 
</HEAD> 

<BODY> 

<h1 class="h1joc">Polarització de la llum i lleis de Fresnel</h1> 

<p>En aquesta aplicaci&oacute; s'estudia la polaritzaci&oacute; de la llum i la 
  seva reflexi&oacute; i refracci&oacute; en medis is&ograve;trops. La primera 
  finestra mostra com aconseguir els diferents estats de polaritzaci&oacute; de 
  la llum a partir de la superposici&oacute; de dues ones planes amb certes caracter&iacute;stiques. 
  Les finestres segona i tercera permeten veure el comportament de les ones reflectida 
  i transmesa depenent de les propietats d'una ona incident sobre la superf&iacute;cie 
  de separaci&oacute; de dos medis. El segon medi pot ser diel&egrave;ctric o 
  conductor. S'estudia tant la relaci&oacute; d'amplituds (coeficients de Fresnel) 
  com la variaci&oacute; de l'el&middot;lipse de polaritzaci&oacute;.</p> 

<h2 class="h2joc">Finestra "Polarització"</h2> 

<p>En aquesta finestra s'estudia la superposició de dues ones planes amb els seus 
  vectors el&egrave;ctrics perpendiculars, que viatgen en la mateixa direcció, 
  tenen la mateixa freq&uuml;&egrave;ncia, i amplituds diferents i desfasades 
  entre si.</p> 

<p>Les barres de despla&ccedil;ament permeten modificar les amplituds de les ones 
  p (A<sub>p</sub>) i s (A<sub>s</sub>) i el desfasament &#948;&nbsp;entre 
  elles. El gr&agrave;fic situat a la part inferior representa les dues ones. 
  Els camps el&egrave;ctrics E<sub>p</sub> i E<sub>s</sub> associats poden expressar-se 
  com:</p> 

<p align="center"> <img src="formules/Polar_Ec1.gif"> </p> 

<p>El camp el&egrave;ctric resultant genera, quan es propaga, una espiral de pas 
  el&middot;líptic, que es representa en el gr&agrave;fic superior esquerre. Tamb&eacute; 
  s'indiquen les característiques de l'el&middot;lipse de polarització: les longituds 
  dels semieixos major i menor, i l'angle de l'el&middot;lipse respecte de l'eix 
  p. També s'indica el vector de Stokes <b>S</b> que descriu l'estat de polarització 
  de la llum. Els par&agrave;metres de Stokes es calculen segons:</p> 
  
<p align="center"> <img src="formules/Polar_Ec2.gif"> </p> 

<p>El signe del par&agrave;metre S indica si la llum &eacute;s dextrogira 
  (S&gt;0), &eacute;s a dir, gira en el sentit de las agulles del rellotge, o 
  levogira (S&lt;0), quan gira en sentit antihorari. Aix&ograve; es mostra 
  dins del requadre negre de l'el&middot;lipse posant una D o una L, respectivament.</p> 
  
<h2 class="h2joc">Finestra &quot;Diel&egrave;ctrics&quot;</h2> 

<p>En aquesta finestra s'estudia la reflexió i refracció de la llum en medis diel&egrave;ctrics 
  is&ograve;trops, tenint en compte les fórmules de Fresnel, que especifiquen 
  els valors que pren l'amplitud del camp quan aquest canvia de medi o es reflecteix, 
  en funció de l'amplitud incident. Se suposa a més que els medis no s&oacute;n absorbents per les longituds d'ona amb què es treballa.</p> 

<p>Si una ona incideix sobre una superf&iacute;cie que separa dos medis d'&iacute;ndexs 
  de refracció n i n' amb un angle &#966;&nbsp;(respecte 
  a la normal a la superf&iacute;cie), aquesta es reflecteix amb un angle de reflexió 
  igual a l'incident i es transmet al segon medi amb un angle refractat &#966;' 
  que ve donat per la llei de Snell:</p> 

<p align="center"> <img src="formules/Polar_Ec3.gif"> </p> 

<p>Les barres de despla&ccedil;ament permeten modificar els &iacute;ndexs de refracció 
  dels dos medis i l'angle d'incid&egrave;ncia. L'aplicació calcula l'angle de 
  refracció i mostra els raigs incident (vermell), reflectit (verd) i refractat 
  (blau). També calcula els coeficients de Fresnel, que s&oacute;n els quocients 
  de les amplituds reflectida (A') o refractada (A') respecte a la incident (A):</p> 

<p align="center"> <img src="formules/Polar_Ec4.gif"> </p> 

<p>Els sub&iacute;ndexs p i s fan refer&egrave;ncia al camp que vibra paral&middot;lelament 
  (p) o perpendicular (s) al pla d'incid&egrave;ncia. Aquest ve determinat pel 
  raig incident i la normal a la superf&iacute;cie (en el dibuix correspon al 
  pla de la pr&ograve;pia pantalla). La component p es representa per 
  un vector amb diferents orientacions dins d'aquest pla mentre que la component 
  s es representa amb un vector que apunta cap a fora o cap a dins del 
  pla de la pantalla.</p> 
  
<p>En el cas d'incidència normal, les f&oacute;rmules esdevenen:</p> 

<p align="center"> <img src="formules/Polar_Ec5.gif"> </p> 

<p>Quan es polsa el botó <b>&quot;Coeficients de Fresnel&quot;</b> (opci&oacute; activada 
  per defecte en entrar al programa), es mostra amb diferents colors la variació 
  dels coeficients de Fresnel amb l'angle d'incid&egrave;ncia. Un punt groc superposat 
  al gr&agrave;fic indica l'angle d'incid&egrave;ncia seleccionat. Hi ha alguns 
  casos d'inter&egrave;s especial:</p> 

<ul> 
  <li> En el cas que l'&iacute;ndex del primer medi sigui m&eacute;s gran que 
    el del segon (n&gt;n') pot produir-se el fenomen de <b>reflexió total</b>, 
    per al qual no hi ha llum transmesa. Aix&ograve; es d&oacute;na per angles 
    d'incid&egrave;ncia m&eacute;s grans que l'angle límit &#966;<sub>l</sub> 
    (angle d'incid&egrave;ncia per al qual &#966;'=&#960;/2):</li> 
  <p align="center"> <img src="formules/Polar_Ec6.gif"> </p> 
  <p>angle que es mostra en el gr&agrave;fic. En aquest cas:</p> 
  <p align="center"> <img src="formules/Polar_Ec7.gif"> </p> 
  <p>&eacute;s a dir, els dos coeficients de reflexi&oacute; tenen m&ograve;dul 
    1 i entre les dues components hi ha nom&eacute;s un desfasament 2(&#946;-&#945;)-&#960;&nbsp; 
    (l'angle &#960;&nbsp;fa refer&egrave;ncia 
    al signe negatiu de r<sub>p</sub>), amb</p> 
  <p align="center"> <img src="formules/Polar_Ec8.gif"> </p> 
  <p>on</p> 
  <p align="center"> <img src="formules/Polar_Ec9.gif"> </p> 
  <li> Quan la llum incideix amb l'angle de Brewster 
&#966;<sub>B</sub>, 
    r<sub>p</sub>=0 i nom&eacute;s hi ha llum reflectida en el pla perpendicular 
    al d'incid&egrave;ncia. L'angle de Brewster, que es mostra en el gr&agrave;fic, 
    es calcula segons:</li> 
  <p align="center"> <img src="formules/Polar_Ec10.gif"> </p> 
</ul> 

<p>Polsant el botó <b>&quot;Polaritzaci&oacute;&quot;</b> s'activa una nova finestra, en 
  la qual es mostren les el&middot;lipses de polaritzaci&oacute; de la llum incident, 
  reflectida i transmesa, cadascuna de les quals apareix amb els mateixos colors 
  que els raigs als quals corresponen. L'escala dels eixos va entre 0 i 1, en 
  el cas que aquesta canvi&iuml; s'indica la posició dels nous valors. Es mostren 
  també les característiques de l'ona incident, que s&oacute;n les que s'han introdu&iuml;t 
  a la finestra &quot;Polaritzaci&oacute;&quot; i que es poden modificar accedint a la finestra 
  esmentada.</p> 

<p>En el cas que hi hagi <b>reflexió total</b>, no es pinta l'el&middot;lipse 
  de polaritzaci&oacute; transmesa (blau), ja que no existeix. A més, es mostren 
  els valors dels angles 2&#945; (angp) i 2&#946;&nbsp;(angs), 
  i també el desfasament total entre les components s i p per 
  la llum reflectida, que ser&agrave; el que portava la llum incident m&eacute;s 
  (angs-angp-&#960;). Es pot veure com aquest 
  varia amb l'angle d'incid&egrave;ncia i els &iacute;ndexs, i com per reflexi&oacute; 
  total es pot obtenir llum polaritzada el&middot;l&iacute;ptica a partir de llum 
  incident polaritzada linealment.</p> 
  
<p>D'altra banda, es pot observar com per un angle d'incid&egrave;ncia igual al 
  de Brewster, la llum reflectida est&agrave; polaritzada linealment en la direcci&oacute; 
  perpendicular al pla d'incid&egrave;ncia.</p> 

<h2 class="h2joc">Finestra &quot;Conductors&quot;</h2> 

<p>En aquesta finestra s'estudia la reflexió quan la llum incideix sobre un medi 
  is&ograve;trop de conductivitat no nul&middot;la. En aquest cas l'&iacute;ndex 
  de refracci&oacute; del segon medi és complex,</p> 

<p align="center"> <img src="formules/Polar_Ec11.gif"> </p> 

<p>on n' i k (coeficient d'extinci&oacute;) s&oacute;n constants reals 
  i positives relacionades amb la constant diel&egrave;ctrica i la conductivitat 
  del medi. En el programa n' pot variar entre 0.1 i 3.5 i k pot variar 
  entre 0 (cas &quot;Diel&egrave;ctrics&quot;) i 5.</p> 

<p>Les f&oacute;rmules de Fresnel anteriors continuen sent v&agrave;lides per&ograve; 
  considerant l'índex de refracció complex pel segon medi. Els coeficients de 
  reflexi&oacute;, després d'algunes operacions, esdevenen:</p> 

<p align="center"> <img src="formules/Polar_Ec12.gif"> </p> 

<p>on totes les quantitats s&oacute;n reals excepte l'&iacute;ndex de refracci&oacute; 
  del segon medi i el producte</p> 

<p align="center"> <img src="formules/Polar_Ec13.gif"> </p> 

<p>i s'ha tingut en compte que la llei de Snell segueix sent v&agrave;lida:</p> 

<p align="center"> <img src="formules/Polar_Ec14.gif"> </p> 

<p>Aqu&iacute; &#966;' t&eacute; un sentit formal i la seva 
  interpretaci&oacute; no &eacute;s geom&egrave;trica.</p> 
  
<p>Com que els coeficients de Fresnel anteriors s&oacute;n complexos, les ones 
  reflectides poden patir canvis de fase (&#958;<sub>p</sub> 
  i &#958;<sub>s</sub> per la component paral·lela 
  i perpendicular, respectivament), que depenen tant dels &iacute;ndexs de refracci&oacute; 
  dels dos medis com de l'angle d'incidència. Aquests par&agrave;metres es poden 
  modificar amb les barres de despla&ccedil;ament. Es mostra tamb&eacute; el desfasament 
  total entre les components s i p per la llum reflectida, que 
  &eacute;s el que portava la llum incident m&eacute;s 
(&#958;<sub>s</sub>-&#958;<sub>p</sub>). 
  Cal notar com, en el cas que en la reflexi&oacute; no s'introdueixi un desfasament 
  addicional entre les dues components, les ones incident i reflectida giren en 
  sentit oposat (si una &eacute;s dextrogira, l'altra &eacute;s levogira, 
  i a l'inrev&eacute;s). Aix&ograve; &eacute;s nom&eacute;s conseq&uuml;&egrave;ncia 
  del fet que quan descrivim l'estat de polaritzaci&oacute; d'aquestes ones les 
  estem mirant des de costats oposats (sempre s'ha d'observar l'ona en el sentit 
  en qu&egrave; avan&ccedil;a).</p> 
  
<p>En el cas d'incidència normal, es recuperen les fórmules que s'han vist pels 
  dielèctrics però amb l'índex de refracció complex, és a dir: </p> 
  
<p align="center"> <img src="formules/Polar_Ec15.gif"> </p> 

<p>El cas de la llum <b>transmesa</b> requereix una anàlisi més exhaustiva. Aqu&iacute; 
  només s'estudia el cas d'<b>incidència normal</b>, per al qual el factor de 
  transmissi&oacute; T, definit com el quocient entre l'energia per unitat d'&agrave;rea 
  transmesa respecte a la incident, resulta:</p> 

<p align="center"> <img src="formules/Polar_Ec16.gif"> </p> 

<p>(R &eacute;s el factor de reflexi&oacute;). L'ona transmesa es pot escriure 
  com una ona plana que es propaga en el medi conductor en la direcci&oacute; 
  z (perpendicular a la superf&iacute;cie de separaci&oacute;) i amb 
  un &iacute;ndex de refracci&oacute; complex. El seu camp el&egrave;ctric es 
  pot escriure com: </p> 

<p align="center"> <img src="formules/Polar_Ec17.gif"> </p> 

<p>Això correspon a una ona plana propagant-se en un medi d'&iacute;ndex n' però 
  amb una amplitud que decau exponencialment amb la distància recorreguda dins 
  del medi (s'ha considerat que z=0 correspon a la superf&iacute;cie de separaci&oacute;). 
  Aquesta dependència es mostra en un gràfic, i tamb&eacute; la distància que 
  ha de rec&oacute;rrer l'ona dins del medi conductor per tal que la seva amplitud 
  decaigui en un factor 1/e, que es coneix amb el nom de profunditat de penetraci&oacute; 
  (z<sub>p</sub>) i caracteritza el medi:</p> 

<p align="center"> <img src="formules/Polar_Ec18.gif"> </p> 

<p> 
&#955;&nbsp;és la longitud d'ona de la llum 
  i també es pot canviar amb una barra de desplaçament.</p> 
  
<br> 
<h2 class="h2joc">Glossari</h2> 

<table width="632" border="0" align="left" cellpadding="5" cellspacing="0"> 
  <tr> 
    <td class="glostit" width="100">Polaritzaci&oacute;</td> 
    <td width="27">&nbsp;</td> 
    <td class="glostit" width="122">Diel&egrave;ctrics</td> 
    <td width="88">&nbsp;</td> 
    <td class="glostit" width="179">Conductors</td> 
    <td width="56">&nbsp;</td> 
  </tr> 
  <tr> 
    <td class="glost" width="100">Amplitud ona p</td> 
    <td width="27">A<sub>p</sub> 
</td> 
    <td class="glost" width="122">Angle d'incid&egrave;ncia</td> 
    <td width="88"> 
&#966; 
</td> 
    <td class="glost" width="179">Angle d'incid&egrave;ncia</td> 
    <td width="56"> 
&#966; 
</td> 
  </tr> 
  <tr> 
    <td class="glost" width="100">Amplitud ona s</td> 
    <td width="27">A<sub>s</sub> 
</td> 
    <td class="glost" width="122">Angle de refracció</td> 
    <td width="88"> 
&#966;'</td> 
    <td class="glost" width="179">Longitud d'ona</td> 
    <td width="56"> 
&#955; 
</td> 
  </tr> 
  <tr> 
    <td class="glost" width="100">Desfasament</td> 
    <td width="27"> 
&#948; 
</td> 
    <td class="glost" width="122">Angle de Brewster</td> 
    <td width="88"> 
&#966;<sub>B</sub> 
</td> 
    <td class="glost" width="179">angp</td> 
    <td width="56"> 
&#958;<sub>p</sub> 
</td> 
  </tr> 
  <tr> 
    <td class="glost" width="100">&nbsp;</td> 
    <td width="27">&nbsp;</td> 
    <td class="glost" width="122">Angle l&iacute;mit</td> 
    <td width="88"> 
&#966;<sub>l</sub> 
</td> 
    <td class="glost" width="179">angs</td> 
    <td width="56"> 
&#958;<sub>s</sub> 
</td> 
  </tr> 
  <tr> 
    <td class="glost" width="100">&nbsp;</td> 
    <td width="27">&nbsp;</td> 
    <td class="glostit2" width="122">Reflexi&oacute; total</td> 
    <td width="88">&nbsp;</td> 
    <td class="glost" width="179">Desfasament total</td> 
    <td width="56"> 
&#948;+&#958;<sub>s</sub>-&#958;<sub>p</sub> 
</td> 
  </tr> 
  <tr> 
    <td class="glost" width="100">&nbsp;</td> 
    <td width="27">&nbsp;</td> 
    <td class="glost" width="122">angp</td> 
    <td width="88">2&#945; 
</td> 
    <td class="glost" width="179">Profunditat de penetraci&oacute;</td> 
    <td width="56">z<sub>p</sub> 
</td> 
  </tr> 
  <tr> 
    <td class="glost" width="100">&nbsp;</td> 
    <td width="27">&nbsp;</td> 
    <td class="glost" width="122">angs</td> 
    <td width="88">2&#946; 
</td> 
    <td class="glost" width="179">&nbsp;</td> 
    <td width="56"> 
</td> 
  </tr> 
  <tr> 
    <td class="glost" width="100">&nbsp;</td> 
    <td width="27">&nbsp;</td> 
    <td class="glost" width="122">Desfasament total</td> 
    <td width="88"> 
&#948;+2(&#946;-&#945;)-&#960; 
</td> 
    <td class="glost" width="179">&nbsp;</td> 
    <td width="56">&nbsp;</td> 
  </tr> 
</table> 


</BODY> 
</HTML>