<HTML>

<HEAD>

<TITLE>Documentació programa Experiment de Young</TITLE>
<META NAME="description" CONTENT="hypertext">
<META NAME="keywords" CONTENT="hypertext">
<META NAME="resource-type" CONTENT="document">
<META NAME="distribution" CONTENT="global">
<META HTTP-EQUIV="Content-Type" CONTENT="text/html">
<META NAME="Generator" CONTENT="LaTeX2HTML v2K.1beta">
<META HTTP-EQUIV="Content-Style-Type" CONTENT="text/css">
<LINK REL="STYLESHEET" HREF="entradaA.css">
</HEAD>

<h1 class="h1joc">Experiment de Young</h1>

<p>En aquesta aplicaci&oacute; s'estudien les interferències de Young que resulten 
  de la interacció d'un cert nombre d'ones. La utilització d'una font extensa 
  o de dues fonts puntuals separades entre sí permet estudiar també el fenomen 
  de coherència espacial. </p>
  
<h2 class="h2joc">Finestra "Ona plana"</h2>

<p>En aquesta finestra s'estudien les interfer&egrave;ncies de Young que resulten 
  de la superposici&oacute; de diverses fonts puntuals de llum. Una ona plana 
  incideix sobre un pla que t&eacute; N escletxes normals al pla del dibuix (representat 
  a la part superior esquerra) i separades una dist&agrave;ncia d entre s&iacute;. 
  Cadasc&uacute; d'aquests forats emet, pel principi de Huygens, ones coherents. 
  Si observem la seva superposici&oacute; en un pla situat a una dist&agrave;ncia 
  D del de les escletxes, veiem franges d'interfer&egrave;ncia normals al pla 
  del dibuix (que es representen a la part superior dreta).</p>
<p>Considerem primer el cas <b>N=2</b> (<b>doble escletxa de Young</b>): si suposem 
  que l'amplitud de les dues ones &eacute;s igual per a qualsevol punt del pla 
  d'observaci&oacute;, la intensitat de les franges &eacute;s:</p>

<p align="center"> <img src="formules/Young_Ec1.gif"> </p>

<p>on &#955;&nbsp;és la longitud d'ona de la llum (en el buit) i &#916;&nbsp;&eacute;s 
  la difer&egrave;ncia de cam&iacute; &ograve;ptic entre les dues ones que han 
  passat per les dues escletxes. Si prenem l'aproximaci&oacute;</p>

<p align="center"> <img src="formules/Young_Ec2.gif"> </p>

<p>(pla d'observaci&oacute; prou allunyat), la difer&egrave;ncia de cam&iacute; 
  &ograve;ptic &eacute;s:</p>
  
<p align="center"> <img src="formules/Young_Ec3.gif"> </p>

<p>on n &eacute;s l'index de refracci&oacute; del medi per on es propaguen i x 
  &eacute;s un eix paral&middot;lel a la recta on es troben les escletxes. Recordem 
  que d &eacute;s la separaci&oacute; entre les escletxes i D la dist&agrave;ncia 
  entre el pla que les cont&eacute; i el d'observaci&oacute;.</p>
  
<p>Quan la difer&egrave;ncia de cam&iacute; &ograve;ptic sigui un m&uacute;ltiple 
  sencer de la longitud d'ona hi haur&agrave; interfer&egrave;ncia constructiva. 
  Fixades n, d i D aix&ograve; nom&eacute;s dep&egrave;n de la coordenada x, la 
  qual cosa explica que es vegin franges d'interfer&egrave;ncia. Les posicions 
  del m&agrave;xims venen donades per:</p>

<p align="center"> <img src="formules/Young_Ec4.gif"> </p>

<p>on M &eacute;s un nombre sencer. La dist&agrave;ncia entre m&agrave;xims (interfranja) 
  &eacute;s:</p>
  
<p align="center"> <img src="formules/Young_Ec5.gif"> </p>

<p>Entre cada dos m&agrave;xims es troba un m&iacute;nim, per al qual la interfer&egrave;ncia 
  &eacute;s destructiva i la intensitat s'anul&middot;la. El programa indica la 
  dist&agrave;ncia entre m&agrave;xims i entre m&iacute;nims que, en el cas N=2, 
  coincideixen. </p>
<p>A m&eacute;s, l'aplicaci&oacute; permet variar els par&agrave;metres del sistema 
  i veure l'evoluci&oacute; de la imatge d'interfer&egrave;ncies corresponent. 
  El color es correspon amb la longitud d'ona seleccionada. Si es vol, prement 
  el bot&oacute; &quot;Gr&agrave;fic&quot; es mostra el perfil d'intensitats. 
  Prement el bot&oacute; &quot;Imatge&quot; es retorna a la imatge de les franges. 
  Aquesta es veu per defecte en escala lineal, cosa que ve indicada amb el bot&oacute; 
  &quot;Intensitat lineal on&quot;. Quan aquest es prem, la intensitat est&agrave; 
  en escala logar&iacute;tmica i a dins del bot&oacute; posa &quot;Intensitat 
  logar&iacute;tmica on&quot;. L'amplada de la finestra gr&agrave;fica es modifica 
  autom&agrave;ticament per tal de representar amb prou resoluci&oacute; els m&agrave;xims 
  i m&iacute;nims de la figura.</p>
<p>En el cas que hi hagi <b>N escletxes</b>, la intensitat de les franges pren 
  la forma:</p>

<p align="center"> <img src="formules/Young_Ec6.gif"> </p>

<p>Aquesta funci&oacute; t&eacute; una s&egrave;rie de m&agrave;xims principals 
  d'intensitat m&agrave;xima, separats la mateixa dist&agrave;ncia que abans (&#916;x). 
  Entre cada 2 m&agrave;xims principals es troben N-2 m&agrave;xims secundaris 
  i N-1 m&iacute;nims, d'intensitat nul&middot;la, i separats entre s&iacute;:</p>
    
<p align="center"> <img src="formules/Young_Ec7.gif"> </p>
  
<p>Es pot comprovar com les f&oacute;rmules per N=2 es redueixen a les del cas 
  &quot;doble escletxa de Young&quot; que s'ha analitzat anteriorment.</p>
<h2 class="h2joc">Finestra "Coher&egrave;ncia espacial"</h2>

<p>En aquesta finestra s'estudia com varia la visibilitat de les franges d'interfer&egrave;ncia 
  en l'experiment de <b>doble escletxa de Young</b> quan es canvien les caracter&iacute;stiques 
  de la font d'il&middot;luminaci&oacute;, per tal d'estudiar el fenomen de coher&egrave;ncia 
  espacial. El factor de visibilitat es defineix com: </p>
  
<p align="center"> <img src="formules/Young_Ec8.gif"> </p>
  
<p>on I<sub>M</sub> i I<sub>m</sub> s&oacute;n les intensitats m&agrave;xima i 
  m&iacute;nima de les franges, respectivament.</p>
<p>Pel que fa a la font d'il&middot;luminaci&oacute;, si en la finestra &quot;Ona 
  plana&quot; les escletxes eren il&middot;luminades per una ona plana, ara existeixen 
  diverses opcions:</p>

<ul>
  <li><b>Una font puntual</b> situada a una certa dist&agrave;ncia x<sub>0</sub> 
    respecte el centre de les escletxes (x=0): correspon al cas anterior per&ograve; 
    amb un terme afegit a la difer&egrave;ncia de cam&iacute; &ograve;ptic entre 
    les dues ones, com a conseq&uuml;&egrave;ncia que la font ja no &eacute;s 
    equidistant a les escletxes:</li>
  <p align="center"> <img src="formules/Young_Ec9.gif"> </p>
  <p>on a és la distància entre el pla de la font i el de les escletxes. Per tant, 
    les franges ja no estan centrades a x=0, sin&oacute; a la posici&oacute; per 
    a la qual s'anul&middot;la la difer&egrave;ncia de cam&iacute; &ograve;ptic 
    anterior, &eacute;s a dir:</p>
  <p align="center"> <img src="formules/Young_Ec10.gif"> </p>
  <p>Aix&iacute;, si la font se situa per sobre del centre, les franges es desplacen 
    en sentit oposat, &eacute;s a dir cap a baix, o cap a la dreta en el gr&agrave;fic. 
    En qualsevol cas, I<sub>m</sub>=0 i, per tant, V=1. </p>
  <li><b>Dues fonts puntuals</b> separades una certa dist&agrave;ncia x<sub>0</sub>: 
    la intensitat resultant ser&agrave; la suma de la contribuci&oacute; de cadascuna 
    de les fonts, que donen unes franges centrades en diferents punts:</li>
  <p align="center"> <img src="formules/Young_Ec11.gif"> </p>
  <p>Aix&ograve; d&oacute;na lloc a una estructura de franges amb la mateixa interfranja 
    que si hi hagu&eacute;s una sola font per&ograve; menys contrastades. El factor 
    de visibilitat &eacute;s:</p>
  <p align="center"> <img src="formules/Young_Ec12.gif"> </p>
  <li><b>Una font puntual extensa</b>: la distribuci&oacute; d'intensitats es 
    trobar&agrave; fent la superposici&oacute; (integral) de les franges resultants 
    al llarg de tota l'extensi&oacute; &#916;S de la font:</li>
  <p align="center"> <img src="formules/Young_Ec13.gif"> </p>
  <p>Com abans, la interfranja no varia per&ograve; la visibilitat de les franges 
    esdev&eacute;:</p>
  <p align="center"> <img src="formules/Young_Ec14.gif"> </p>
</ul>

<br>
<h2 class="h2joc">Glossari</h2>

<table width="600" border="0" align="left" cellpadding="5" cellspacing="0">
  <tr> 
    <td class="glostit" width="184">Ona plana</td>
    <td width="60">&nbsp;</td>
    <td class="glostit" width="301">Coherència espacial</td>
    <td width="22">&nbsp;</td>
  </tr>
  <tr> 
    <td class="glost" width="184">Nombre d'escletxes</td>
    <td width="60">N</td>
    <td class="glost" width="301">Distància al centre / Posició font puntual</td>
    <td width="22">x<sub>0</sub></td>
  </tr>
  <tr> 
    <td class="glost" width="184">Dist&agrave;ncia entre escletxes</td>
    <td width="60">d</td>
    <td class="glost" width="301">Distància entre fonts / Posició 2<sup>a</sup> 
      font puntual</td>
    <td width="22">x<sub>0</sub></td>
  </tr>
  <tr> 
    <td class="glost" width="184">Dist&agrave;ncia entre plans</td>
    <td width="60">D</td>
    <td class="glost" width="301">Dimensi&oacute; de la font (extensa)</td>
    <td width="22">&#916;S</td>
  </tr>
  <tr> 
    <td class="glost" width="184">Longitud d'ona</td>
    <td width="60">&#955;</td>
    <td class="glost" width="301">Dist&agrave;ncia entre escletxes</td>
    <td width="22">d</td>
  </tr>
  <tr> 
    <td class="glost" width="184">&Iacute;ndex de refracci&oacute;</td>
    <td width="60">n</td>
    <td class="glost" width="301">Dist&agrave;ncia entre plans</td>
    <td width="22">D</td>
  </tr>
  <tr> 
    <td class="glost" width="184">Distància entre màxims</td>
    <td width="60">&#916;x</td>
    <td class="glost" width="301">Distància entre plans (a la font)</td>
    <td width="22">a</td>
  </tr>
  <tr>
    <td class="glost" width="184">Distància entre mínims</td>
    <td width="60">&#916;x'</td>
    <td class="glost" width="301">Longitud d'ona</td>
    <td width="22">&#955;</td>
  </tr>
  <tr> 
    <td class="glost" width="184">&nbsp;</td>
    <td width="60">&nbsp;</td>
    <td class="glost" width="301">&Iacute;ndex de refracci&oacute;</td>
    <td width="22">n</td>
  </tr>
  <tr> 
    <td width="184">&nbsp;</td>
    <td width="60">&nbsp;</td>
    <td class="glost" width="301">Distància entre màxims</td>
    <td width="22">&#916;x</td>
  </tr>
  <tr> 
    <td width="184">&nbsp;</td>
    <td width="60">&nbsp;</td>
    <td class="glost" width="301">Factor de visibilitat</td>
    <td width="22">V</td>
  </tr>
</table>

</BODY>
</HTML>