<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<html>
<head>

  


  
  <title>TermoGraf: Men&uacute; &quot;Ayuda&quot;</title>
  <meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1">


  
  
<link rel="stylesheet" href="../../styles.css">
</head>


<body lang="es">


<h1>Men&uacute; &quot;Ayuda&quot;</h1>


<p>Este men&uacute; muestra informaci&oacute;n sobre TermoGraf y c&oacute;mo ponerse 
  en contacto con los autores. Para poder realizarse varias de estas acciones 
  es necesario que el navegador de TermoGraf est&eacute; bien configurado en la 
  <a href="../../reference/menus/win_prefinit.htm#preflook">ventana &quot;Preferencias iniciales&quot;</a>. 
</p>
<hr width="75%">
<h2><a name="help"></a>Men&uacute; &quot;Ayuda&quot;</h2>
<blockquote> 
  <p>Abre el <a href="../../reference/menus/menu_sust.htm#infosust">navegador</a> del sistema operativo 
    con los documentos de informaci&oacute;n dentro del ordenador acerca del funcionamiento 
    de TermoGraf. </p>
</blockquote>
<h2>&nbsp;</h2>
<h2><a name="tutorial"></a>Men&uacute; &quot;Tutorial&quot;</h2>
<blockquote> 
  <p>Abre el documento de informaci&oacute;n acerca del funcionamiento b&aacute;sico 
    de TermoGraf. </p>
</blockquote>
<p>&nbsp;</p>
<h2><a name="helpweb"></a>Men&uacute; &quot;Ayuda (Web)&quot;</h2>
<blockquote> 
  <p>Abre el <a href="../../reference/menus/win_prefinit.htm#preflook">navegador</a> del sistema operativo 
    con la direcci&oacute;n de la p&aacute;gina web correspondiente a la ayuda 
    de TermoGraf. Esta p&aacute;gina ofrece informaci&oacute;n actualizada de 
    las &uacute;ltimas funciones a&ntilde;adidas al programa.</p>
</blockquote>
<p>&nbsp;</p>
<h2><a name="termografweb"></a>Men&uacute; &quot;TermoGraf (Web)&quot;</h2>
<blockquote> 
  <p>Abre el <a href="../../reference/menus/win_prefinit.htm#preflook">navegador</a> del sistema operativo 
    con la direcci&oacute;n de la p&aacute;gina web de TermoGraf.</p>
</blockquote>
<p>&nbsp;</p>
<h2><a name="sendbugs"></a>Men&uacute; &quot;Enviar errores&quot;</h2>
<blockquote> 
  <p>Abre la ventana &quot;Enviar errores&quot; para mandar un correo electr&oacute;nico 
    an&oacute;nimo con informaci&oacute;n acerca de errores encontrados en TermoGraf.</p>
</blockquote>
<table align="center" border="0">
  <tr> 
    <td style="text-align: center;" nowrap><img alt="" src="../../reference/menus/img/win_sendbugs.gif" width="559" height="400"> 
    </td>
  </tr>
  <tr> 
    <td class="piefoto" nowrap>Ventana &quot;Enviar errores&quot;</td>
  </tr>
</table>
<blockquote> 
  <p>Esta ventana tiene los siguientes apartados:</p>
  <ul>
    <li><b>Para:</b> Direcci&oacute;n de soporte t&eacute;cnico de TermoGraf. 
      Este campo no es editable.</li>
    <li><b>Asunto:</b> T&iacute;tulo del mensaje. Este campo no es editable.</li>
    <li><b>Adjuntar:</b> Documento opcional para enviar con el e-mail.</li>
    <li><b>Opci&oacute;n &quot;Adjuntar documento actual de TermoGraf&quot;:</b> 
      Env&iacute;a una copia del documento con el que se est&aacute; trabajando. 
      Se utiliza para poder reproducir el error en las mismas condiciones originales.</li>
    <li><b>Mensaje:</b> Informaci&oacute;n del usuario acerca del error. Un error 
      en el programa no puede ser corregido si no es posible reproducirlo, por 
      lo que se recomienda enviar la informaci&oacute;n m&aacute;s concreta posible 
      de los pasos que se han dado para producir el error.</li>
    <li><b>Error:</b> Informaci&oacute;n del funcionamiento de TermoGraf en la 
      &uacute;ltima sesi&oacute;n. Las primeras l&iacute;neas informan sobre el 
      contexto inform&aacute;tico en el que trabaja el programa.</li>
  </ul>
  <p>&nbsp;</p>
</blockquote>
<h2><a name="about"></a>Men&uacute; &quot;Acerca de TermoGraf&quot;</h2>
<blockquote> 
  <p>Abre la ventana &quot;Acerca de TermoGraf&quot; con informaci&oacute;n sobre 
    la versi&oacute;n que se est&aacute; utilizando y los autores de TermoGraf.</p>
</blockquote>
<p>&nbsp;</p>
</body>
</html>
