<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<html>
<head>

  


  
  <title>TermoGraf: Men&uacute; &quot;Edici&oacute;n&quot;</title>
  <meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1">


  
  
<link rel="stylesheet" href="../../styles.css">
</head>


<body lang="es">


<h1>Men&uacute; &quot;Edici&oacute;n&quot;</h1>


<p>Los comandos de este men&uacute; realizan diferentes acciones de visualizaci&oacute;n 
  y edici&oacute;n sobre el documento.</p>
<hr width="75%">
<h2><a name="undo"></a>Men&uacute; &quot;Deshacer&quot;</h2>
<blockquote>
  <p>Elimina los cambios producidos por la &uacute;ltima acci&oacute;n del usuario.</p>
</blockquote>
<p>&nbsp;</p>
<h2><a name="redo"></a>Men&uacute; &quot;Rehacer&quot;</h2>
<blockquote> 
  <p>Realiza de nuevo los cambios eliminados mediante el men&uacute; &quot;Deshacer&quot;.</p>
  <p>&nbsp;</p>
</blockquote>
<h2><a name="copy"></a>Men&uacute; &quot;Copiar&quot;</h2>
<blockquote> 
  <p>Copia al portapapeles del sistema operativo partes del documento. </p>
  <ul>
    <li><b>Etiquetas:</b> Copia las <a href="../../reference/winMain/diag.htm#labels">etiquetas</a> 
      del diagrama termodin&aacute;mico. Al pegarlas se inse&aacute;n en la 
      pantalla activa del documento.</li>
    <li><b>Pantalla:</b> Copia los datos de la pantalla actual del documento. 
      Al pegarlo se crear&aacute; una nueva pantalla.</li>
    <li><b>Imagen:</b> Abre la <a href="../../reference/menus/menu_file.htm#print">ventana &quot;Imprimir/Guardar 
      imagen&quot;</a> donde se puede elegir la imagen a copiar. </li>
  </ul>
  <p>Independientemente de este men&uacute;, cuando est&aacute; seleccionado un 
    texto se puede usar la combinaci&oacute;n usual de teclas &quot;Control + 
    C&quot; para copiar su contenido al portapapeles.</p>
  <p>&nbsp;</p>
</blockquote>
<h2><a name="paste"></a>Men&uacute; &quot;Pegar&quot;</h2>
<blockquote> 
  <p>Pega el contenido del portapapeles en el documento. Seg&uacute;n el tipo 
    de contenido se insertar&aacute; una imag&eacute;n o texto en el diagrama, 
    una nueva pantalla, etc.</p>
  <p>&nbsp;</p>
  
</blockquote>
<h2><a name="step_prev"></a>Men&uacute; &quot;Pantalla anterior&quot;</h2>
<blockquote> 
  <p>Muestra la pantalla anterior a la actual en un documento multi-pantalla. 
    Realiza la misma acci&oacute;n que el <a href="../../reference/winMain/pan_screens.htm#prev">bot&oacute;n 
    &quot;Pantalla anterior&quot;</a> del panel de pantallas.</p>
  <p>&nbsp;</p>
</blockquote>
<h2><a name="step_next"></a>Men&uacute; &quot;Pantalla siguiente&quot;</h2>
<blockquote> 
  <p>Muestra la pantalla siguiente a la actual en un documento multi-pantalla. 
    Realiza la misma acci&oacute;n que el <a href="../../reference/winMain/pan_screens.htm#next">bot&oacute;n 
    &quot;Pantalla siguiente&quot;</a> del panel de pantallas.</p>
  <p>&nbsp;</p>
</blockquote>
<h2><a name="narrow_ruler"></a>Men&uacute; &quot;Estrechar regla&quot;</h2>
<blockquote> 
  <p>Cambia la visualizaci&oacute;n de la <a href="../../reference/winMain/pan_diag.htm#reglas">regla 
    del eje de ordenadas</a> del diagrama termodin&aacute;mico, pasando de mostrar 
    sus divisiones de horizontal a vertical y as&iacute; ocupar menos espacio.</p>
</blockquote>
<blockquote>&nbsp;</blockquote>
<h2><a name="lang"></a>Men&uacute; &quot;Idiomas&quot;</h2>
<blockquote> 
  <p>Cambia el idioma en el que se muestra TermoGraf. Algunos idiomas pueden no estar traducidos en su totalidad por lo que algunas 
    partes del programa aparecer&aacute;n sin traducir. En la ventana &quot;Idiomas&quot; se muestra el porcentaje de traducci&oacute;n de cada idioma.</p>
  <p>TermoGraf utiliza el est&aacute;ndar Unicode, ampliamente descrito en <a href="http://www.unicode.org">www.unicode.org</a>, 
    que asegura la correcta interpretaci&oacute;n de los caracteres de cada alfabeto. 
    No obstante es necesario que el sistema operativo disponga de dichos caracteres 
    por lo que podr&aacute; ocurrir que determinadas graf&iacute;as no se muestren 
    correctamente.</p>
  <p>&nbsp;</p>
</blockquote>
<h2><a name="version_est"></a>Men&uacute; &quot;Versi&oacute;n estudiante&quot; 
  [TermoGraf Pro] </h2>
<blockquote> 
  <p>Abre una ventana de TermoGraf como versi&oacute;n estudiante, utilizada principalmente 
    para verificar los documentos multi-ejercicio y su correcci&oacute;n.</p>
  </blockquote>
<p>&nbsp;</p>
<h2><a name="trazo"></a>Men&uacute; &quot;Trazos gruesos&quot; [TermoGraf 
  Pro]</h2>
<blockquote> 
  <p>Cambia el grosor de las l&iacute;neas dibujadas en el <a href="../../reference/winMain/diag.htm">diagrama 
    termodin&aacute;mico</a> de trazo fino a trazo grueso para mejorar la visibilidad 
    del diagrama, especialmente cuando se utiliza una pantalla de videoproyecci&oacute;n.</p>
</blockquote>
<p>&nbsp;</p>
<h2><a name="lockprops"></a>Men&uacute; &quot;Presentaci&oacute;n 
  restringida&quot; [TermoGraf Pro]</h2>
<blockquote> 
  <p>Deshabilita los botones de mostrar/ocultar propiedades cuando el documento 
    se abre con la versi&oacute;n estudiante de TermoGraf. De esta forma se impide 
    que el estudiante pueda ver ciertos resultados, oblig&aacute;ndole a realizar 
    los c&aacute;lculos personalmente.</p>
</blockquote>
<p>&nbsp;</p>
<h2><a name="showprops"></a>Men&uacute; &quot;Mostrar propiedades&quot; 
  [TermoGraf Pro]</h2>
<blockquote> 
  <p>Permite configurar de forma r&aacute;pida qu&eacute; conjunto de propiedades 
    termodin&aacute;micas se desea que aparezcan tanto en el <a href="../../reference/winMain/pan_cursor.htm">panel 
    de cursor</a> como en el <a href="../../reference/winMain/pan_props.htm">panel de propiedades</a>. 
    Estos men&uacute;s est&aacute;n definidos para mostrar &uacute;nicamente las 
    propiedades que intervienen en el ejercicio a resolver, evitando elementos 
    innecesarios que distraigan la atenci&oacute;n.</p>
</blockquote>
<p>&nbsp;</p>
<h2><a name="fontsize"></a>Men&uacute; &quot;Tama&ntilde;o de letra&quot; 
  [TermoGraf Pro]</h2>
<blockquote> 
  <p>Cambia el tama&ntilde;o de la letra de la ventana principal, mejorando la 
    visibilidad de los valores cuando se utiliza una pantalla de videoproyecci&oacute;n. 
    La <a href="../../reference/winMain/diag.htm#text">etiquetas de texto</a> del diagrama 
    termodin&aacute;mico cambiar&aacute;n su tama&ntilde;o &uacute;nicamente cuando 
    est&eacute;n definidas con la <a href="../../reference/menus/win_graflabel.htm#estilo">opci&oacute;n 
    &quot;Tama&ntilde;o autom&aacute;tico&quot;</a>.</p>
</blockquote>
<p>&nbsp;</p>
<h2><a name="winsize"></a>Men&uacute; &quot;Tama&ntilde;o de ventana&quot; 
  [TermoGraf Pro]</h2>
<blockquote> 
  <p>Modifica el tama&ntilde;o de la ventana principal de TermoGraf a valores 
    predeterminados, est&aacute;ndares de resoluci&oacute;n de pantallas de ordenador. 
    El men&uacute; &quot;Fijar tama&ntilde;o&quot; inhibe la posibilidad de cambiar 
    el tama&ntilde;o de la ventana, asegurando que la visualizaci&oacute;n de 
    la pantalla sea siempre la misma independientemente del ordenador que se est&eacute; 
    utilizando. Se recomienda utilizar el valor &quot;800x600&quot; cuando se 
    piensa distribuir copias de un ejercicio ya que resoluciones m&aacute;s grandes 
    no siempre son posibles en todos los ordenadores.</p>
  <p>&nbsp;</p>
  
</blockquote>
</body>
</html>
