<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<html>
<head>

  


  
  <title>TermoGraf: Men&uacute; &quot;Ventanas&quot;</title>
  <meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1">


  
  
<link rel="stylesheet" href="../../styles.css">
</head>


<body lang="es">


<h1>Men&uacute; &quot;Ventanas&quot;</h1>


<p>Este men&uacute; contiene las ventanas auxiliares de TermoGraf.</p>
<hr width="75%">
<h2><a name="tabla"></a>Men&uacute; &quot;Tabla&quot;</h2>
<blockquote> 
  <p>Abre la <a href="../../reference/winAux/win_table.htm">ventana &quot;Tabla&quot;</a> para 
    crear tablas de datos&nbsp;con los valores de los <a href="../../reference/winMain/diag.htm#est">elementos 
    termodin&aacute;micos</a> y de las&nbsp;<a href="../../reference/winAux/win_vars.htm">variables 
    de usuario</a>. Los datos se pueden manipular para mostrarlos en una tabla 
    de datos, representarlos en las gr&aacute;ficas inferiores de la ventana o&nbsp;guardarlos 
    como texto para ser utilizados en otro programa. El contenido de esta ventana 
    tambi&eacute;n se puede&nbsp;imprimir mediante el&nbsp;<a href="../../reference/menus/menu_file.htm#print">men&uacute; 
    &quot;Imprimir/Guardar imagen&quot;</a>.</p>
  <p>&nbsp;</p>
</blockquote>
<h2><a name="ecuac"></a>Men&uacute; &quot;Editor de ecuaciones&quot;</h2>
<blockquote> 
  <p>Abre la <a href="../../reference/winAux/win_equations.htm">ventana &quot;Editor de ecuaciones&quot;</a> 
    para crear ecuaciones con las propiedades termodin&aacute;micas de los estados, 
    procesos y ciclos introducidos en el <a href="../../reference/winMain/diag.htm">diagrama 
    termodin&aacute;mico</a>. Las ecuaciones creadas se pueden almacenar como 
    variables para ser manipuladas desde la <a href="../../reference/winAux/win_vars.htm">ventana 
    &quot;Variables&quot;</a> dentro del todo el documento.</p>
  <p>&nbsp;</p>
</blockquote>
<h2><a name="vars"></a>Men&uacute; &quot;Variables&quot;</h2>
<blockquote> 
  <p>Abre la <a href="../../reference/winAux/win_table.htm">ventana &quot;Variables&quot;</a> 
    en donde se gestionan las variables creadas por el usuario. Las variables 
    se utilizan para escribir ecuaciones no contempladas en el programa y obtener 
    su <a href="../../reference/winAux/win_vars.htm#pan_vars">resultado</a>, <a href="../../reference/winAux/win_table.htm">tablas 
    de datos</a>, <a href="../../reference/winAux/win_table.htm#grafs">gr&aacute;ficas</a> 
    o para utilizarlas en la elaboraci&oacute;n de un <a href="../../debug_link.htm">documento 
    multiejercicio</a>.</p>
  <p>&nbsp;</p>
</blockquote>
<h2><a name="enunc"></a>Men&uacute; &quot;Enunciado&quot;</h2>
<blockquote> 
  <p>Abre la <a href="../../reference/winAux/win_enunc.htm">ventana &quot;Enunciado&quot;</a> 
    en donde se muestra el enunciado y las preguntas a resolver para el documento de TermoGraf, 
    que variar&aacute;n de un alumno a otro en caso de ser un documento multiejercicio. 
     La edici&oacute;n del enunciado se realiza en 
    la <a href="../../debug_link.htm">ventana &quot;Editar enunciado &quot;</a> de 
    la versi&oacute;n TermoGraf Pro.</p>
</blockquote>
<p>&nbsp;</p>
<h2><a name="mail"></a>Men&uacute; &quot;Enviar e-mail&quot;</h2>
<blockquote> 
  <p>Abre la <a href="../../reference/winAux/win_mail.htm">ventana &quot;Enviar e-mail&quot;</a> 
    desde donde se puede enviar un correo electr&oacute;nico desde TermoGraf. 
    Est&aacute; pensada para que los estudiantes puedan enviar sus dudas o ejercicios 
    resueltos al profesor sin depender del ordenador desde el que est&eacute;n 
    trabajando, ya que podr&iacute;a tener un programa de correo de dif&iacute;cil 
    configuraci&oacute;n o no tenerlo instalado.</p>
  <p>&nbsp;</p>
</blockquote>
<h2><a name="ftp"></a>Men&uacute; &quot;Conexi&oacute;n FTP&quot;</h2>
<blockquote> 
  <p>Abre&nbsp;la <a href="../../reference/winAux/win_ftp.htm">ventana &quot;Conexi&oacute;n 
    FTP&quot;</a> desde donde se envian y reciben documentos mediante el est&aacute;ndar 
    FTP -File Transfer Protocol-, ampliamente utilizado en la red para el intercambio 
    de ficheros. Est&aacute; pensada para facilitar la comunicaci&oacute;n entre 
    alumno y profesor habilitando un espacio com&uacute;n donde el profesor pueda 
    dejar los ejercicios y que el alumno los tenga disponibles cuando vaya a trabajarlos. 
    Con esta ventana se evita depender de que el ordenador donde se est&eacute; 
    trabajando disponga de un programa de FTP con una dif&iacute;cil configuraci&oacute;n 
    o no tenerlo instalado.</p>
  <p>&nbsp;</p>
</blockquote>
<h2><a name="cicloedit"></a>Men&uacute;&quot;Editor de ciclos&quot; [TermoGraf 
  Pro]</h2>
<blockquote> 
  <p>Abre la <a href="../../debug_link.htm">ventana &quot;Editor de ciclos&quot;</a> 
    en donde se facilita la creaci&oacute;n de ciclos de uso frecuente en el desarrollo 
    de una asignatura de termodin&aacute;mica. Esta ventana s&oacute;lo est&aacute; 
    disponible para la versi&oacute;n TermoGraf Pro.</p>
</blockquote>
<p>&nbsp;</p>
<h2><a name="enuncedit"></a>Men&uacute;&quot;Editar enunciado&quot; [TermoGraf 
  Pro]</h2>
<blockquote> 
  <p>Abre la <a href="../../debug_link.htm">ventana &quot;Editar enunciado&quot;</a> 
    en donde se edita el contenido del enunciado del ejercicio. Esta ventana s&oacute;lo 
    est&aacute; disponible para la versi&oacute;n TermoGraf Pro.</p>
</blockquote>
<p>&nbsp;</p>
<h2><a name="multiej"></a>Men&uacute;&quot;Multiejercicio&quot; [TermoGraf 
  Pro]</h2>
<blockquote> 
  <p>Abre la <a href="../../debug_link.htm">ventana &quot;Multiejercicio&quot;</a> 
    en donde se gestiona la creaci&oacute;n de un documento multiejercicio. Los 
    documentos multiejercicio contienen variantes de un mismo enunciado de forma 
    que a diferentes estudiantes les correspondan diferentes preguntas. Esta ventana 
    s&oacute;lo est&aacute; disponible para la versi&oacute;n TermoGraf Pro.</p>
</blockquote>
<p>&nbsp;</p>
<h2><a name="correc"></a>Men&uacute;&quot;Correcci&oacute;n&quot; [TermoGraf 
  Pro]</h2>
<blockquote> 
  <p>Abre la <a href="../../debug_link.htm">ventana &quot;Correcci&oacute;n&quot;</a> 
    en donde se facilita la correcci&oacute;n de los documentos multiejercicio 
    y la presentaci&oacute;n de los resultados obtenidos por los estudiantes. 
    Esta ventana s&oacute;lo est&aacute; disponible para la versi&oacute;n TermoGraf 
    Pro.</p>
</blockquote>
<p>&nbsp;</p>
<blockquote>&nbsp;</blockquote>
</body>
</html>
