<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<html>
<head>
  <title>TermoGraf: Ventana &quot;Etiqueta&quot;</title>


  <meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1">

  
<link rel="stylesheet" href="../../styles.css">

</head>


<body lang="es">
<div style="text-align: center;"><span class="chapter">Ventana &quot;Etiqueta&quot;</span></div>
<br>
Esta ventana muestra las opciones de configuraci&oacute;n de las etiquetas -<a href="../../reference/winMain/diag.htm#text">textos</a>, 
<a href="../../reference/winMain/diag.htm#image">im&aacute;genes</a> o <a href="../../reference/winMain/diag.htm#link">enlaces</a>- 
dibujadas en el diagrama termodin&aacute;mico. Se accede a ella pulsando &quot;doble 
clic&quot; sobre una etiqueta de texto-imagen o a trav&eacute;s del men&uacute; contextual 
que aparece al pulsar el bot&oacute;n derecho del rat&oacute;n sobre cualquier 
etiqueta.<br>
Los cambios que se realizan en la ventana son aplicados autom&aacute;ticamente 
a la etiqueta para comprobar sus efectos de forma inmediata. Mediante los botones 
&quot;Aceptar&quot; y &quot;Cancelar&quot; se aplican definitivamente o rechazan los cambios efectuados.<br>
<br>
<table align="center" border="0">
  <tr valign="top"> 
    <td nowrap> 
      <h2 align="center">Contenido</h2>
      <ul>
        <li><a href="#texto">Controles &quot;Texto&quot;</a></li>
        <li><a href="#posicion">Controles &quot;Posici&oacute;n&quot;</a></li>
        <li><a href="#estilo">Controles &quot;Estilo&quot;</a></li>
        <li><a href="#imagen">Controles &quot;Imagen&quot;</a></li>
        <li><a href="#enlace">Controles &quot;Enlace&quot;</a></li>
      </ul>
    </td>
  </tr>
</table>
 <br>
<table align="center" border="0">
  <tr> 
    <td nowrap> 
      <div align="center"><img alt="" src="../../reference/menus/img/win_graflabel.gif" width="532" height="312"> 
      </div>
    </td>
  </tr>
  <tr> 
    <td class="piefoto" nowrap>Ventana &quot;Etiqueta&quot;&nbsp;</td>
  </tr>
</table>
<p></p>
<hr width="75%">
<br>
<h2><a name="texto"></a>Controles &quot;Texto&quot;</h2>
<blockquote> 
  <p>El texto de la etiqueta admite cualquier caracter contemplado en el est&aacute;ndar 
    <a target="_blank" href="http://www.unicode.org">Unicode</a>, aunque depender&aacute; 
    del ordenador en el que se est&eacute; trabajando el que est&eacute;n disponibles. 
    Con la herramienta &quot;Mapa de caracteres&quot; del sistema operativo del ordenador 
    se puede obtener un listado de todos los caracteres disponibles.<br>
  </p>
  <ul>
    <li><span style="font-weight: bold;">Texto:</span> Texto de la etiqueta.</li>
    <li><span style="font-weight: bold;">Bot&oacute;n &quot;S&iacute;mbolos&quot;:</span> 
      Muestra los botones de caracteres de texto especiales.</li>
    <li><span style="font-weight: bold;">Botonera &quot;S&iacute;mbolos&quot;:</span> Botones 
      con caracteres de texto especiales frecuentemente usados en la notaci&oacute;n 
      termodin&aacute;mica.</li>
  </ul>
</blockquote>
<br>
<h2><a name="posicion"></a>Controles &quot;Posici&oacute;n&quot;</h2>
<blockquote> 
  <p>El tipo de posici&oacute;n de la etiqueta define como se desplaza la etiqueta 
    cuando cambia la escala de representaci&oacute;n del diagrama o los elementos 
    en &eacute;l incluidos. Existen tres tipos de posici&oacute;n:<br>
  </p>
  <ul>
    <li><span style="font-weight: bold;">Posici&oacute;n absoluta:</span>&nbsp;Posici&oacute;n 
      seg&uacute;n las coordenadas de pantalla, independiente de la escala de 
      representaci&oacute;n del diagrama.</li>
    <li><span style="font-weight: bold;">Posici&oacute;n termodin&aacute;mica:</span>&nbsp;Posici&oacute;n 
      seg&uacute;n un estado termodin&aacute;mico, variando su localizaci&oacute;n 
      en el diagrama seg&uacute;n lo haga su escala de representaci&oacute;n.</li>
    <li><span style="font-weight: bold;">Posici&oacute;n asociada:</span>&nbsp;Posici&oacute;n 
      relativa a un elemento del diagrama, variando su localizaci&oacute;n seg&uacute;n 
      las coordenadas de dicho elemento. Para asociar una etiqueta a un elemento 
      basta con seleccionar &quot;Posici&oacute;n asociada&quot; y arrastrar la etiqueta 
      por encima del elemento hasta que el interior de &eacute;ste aparezca en 
      color blanco, indic&aacute;ndose de esta forma que ya se ha realizado la 
      asociaci&oacute;n.<span style="font-weight: bold;"></span></li>
  </ul>
  <p>Los &uacute;ltimos controles muestran las coordenadas de la etiqueta seg&uacute;n 
    el tipo de posici&oacute;n elegida. En el diagrama termodin&aacute;mico, cuando 
    una etiqueta est&aacute; seleccionada se pueden cambiar sus coordenadas arrastrando 
    la etiqueta con el rat&oacute;n o pulsando las teclas &quot;flecha arriba&quot;, &quot;flecha 
    abajo&quot;, &quot;flecha izquierda&quot; o &quot;flecha derecha&quot;.<br>
    <br>
    <br>
  </p>
</blockquote>
<h2><a name="estilo"></a>Controles &quot;Estilo&quot;</h2>
<blockquote> 
  <p>Cambian de formato el texto de la etiqueta.<br>
  </p>
  <ul>
    <li><span style="font-weight: bold;">Tama&ntilde;o:</span> Tama&ntilde;o de 
      letra del texto. Se puede configurar cualquier tama&ntilde;o positivo. Con 
      las flechas &quot;Arriba&quot; y &quot;Abajo&quot; se seleccionan los tama&ntilde;os m&aacute;s 
      frecuentes para hacer un titulo o subtitulo y as&iacute; unificar el dise&ntilde;o&nbsp;en 
      la pantalla. El tama&ntilde;o &quot;Auto&quot; hace que la etiqueta se adapte a la 
      selecci&oacute;n del usuario en el <a href="../../reference/menus/menu_edit.htm#fontsize">men&uacute; 
      &quot;Tama&ntilde;o letra&quot;</a> de la versi&oacute;n TermoGraf Pro.</li>
    <li><span style="font-weight: bold;">Color:</span> Abre una ventana para seleccionar 
      el color del texto.</li>
    <li><span style="font-weight: bold;">Negrita:</span> Cambia el estilo de Normal 
      a Negrita y viceversa.</li>
    <li><span style="font-weight: bold;">Marco:</span> Grosor del marco de la 
      etiqueta.</li>
    <li><span style="font-weight: bold;">Aplicar a todos:</span> Aplica el estilo 
      -o una parte del estilo- a todas las etiqutas del diagrama. Sirve para unificar 
      el dise&ntilde;o utilizado en la pantalla.</li>
  </ul>
</blockquote>
<br>
<h2><a name="imagen"></a>Controles &quot;Imagen&quot;</h2>
<blockquote> 
  <p>Insertan una imagen en el diagrama.<br>
  </p>
  <ul>
    <li><span style="font-weight: bold;">Ancho:</span> Anchura de la imagen, en 
      pixels.</li>
    <li><span style="font-weight: bold;">Alto:</span> Altura de la imagen, en 
      pixels.</li>
    <li><span style="font-weight: bold;">Proporci&oacute;n:</span> Mantener las 
      proporciones&nbsp;de la imagen original para evitar deformaciones. Entre 
      par&eacute;ntesis se indica el tama&ntilde;o de la imagen original.</li>
    <li><span style="font-weight: bold;">Nuevo:</span> Seleccionar una imagen 
      para insertarla en el diagrama.</li>
    <li><span style="font-weight: bold;">Borrar:</span> Eliminar la imagen seleccionada.</li>
  </ul>
  <p>En el diagrama termodin&aacute;mico, cuando una etiqueta con imagen est&aacute; 
    seleccionada se puede cambiar su tama&ntilde;o pulsando las teclas &quot;+&quot; para 
    aumentar su tama&ntilde;o, &quot;-&quot; para disminuir su tama&ntilde;o o &quot;*&quot; para 
    restaurar su tama&ntilde;o original.</p>
  <p>&nbsp;</p>
</blockquote>
<h2><a name="enlace"></a>Controles &quot;Enlace&quot;</h2>
<blockquote>
  <p>Definen una acci&oacute;n del sistema operativo del ordenador como abrir 
    un documento elaborado con otro programa, ejecutar una acci&oacute;n del sistema 
    operativo o abrir una ventana con un texto de informaci&oacute;n. La etiqueta 
    de enlace se muestra con forma de bot&oacute;n para indicar que al pulsarla 
    se ejecutar&aacute; una acci&oacute;n.<br>
  </p>
  <ul>
    <li><span style="font-weight: bold;">Nombre:</span> Nombre de la acci&oacute;n 
      a realizar por el sistema operativo. Puede ser abrir un programa, ejecutar 
      un comando o abrir una ventana de texto.</li>
    <li><span style="font-weight: bold;">Bot&oacute;n &quot;Seleccionar enlace&quot;:</span> 
      Muestra un men&uacute; desplegable con el que seleccionar la acci&oacute;n 
      a realizar. En este men&uacute; tambi&eacute;n aparece la lista de programas 
      definidos por el usuario, entre ellos el navegador de internet&nbsp;por 
      ser un programa de uso est&aacute;ndar que facilita abrir muchos tipos de 
      documentos. Los programas definidos por el usuario se configuran en las 
      <a href="../../reference/menus/win_prefinit.htm">preferencias iniciales</a>.</li>
    <li><span style="font-weight: bold;">Programa/Comando/Acci&oacute;n:</span> 
      Direcci&oacute;n del programa, c&oacute;digo del comando a ejecutar o acci&oacute;n 
      a realizar seg&uacute;n la selecci&oacute;n que se haya realizado.</li>
    <li><span style="font-weight: bold;">Documento/URL/Texto:</span> Direcci&oacute;n 
      del documento dentro del ordenador o en internet para abrir con el programa.</li>
    <li><span style="font-weight: bold;">Bot&oacute;n &quot;Seleccionar documento&quot;:</span>&nbsp;Muestra 
      un men&uacute; desplegable en el que seleccionar el documento del ordenador 
      o direcci&oacute;n de internet que se desea abrir con el programa elegido 
      anteriormente.</li>
  </ul>
</blockquote>
<br>
<br>
</body>
</html>
